<?php
define('FPDF_FONTPATH','font/');
require('mc_indent.php');
//include ("datethai.php");

$InterLigne = 7;
$line=2;
$pdf=new PDF();
$pdf->Open();
$pdf->AddPage();
$pdf->SetMargins(30,10,30);

						//$pdf->SetFont('Arial','',12);
						$pdf->AddFont('Angsau','','angsau.php'); 
						$pdf->SetFont('Angsau','',14);
						$txt = NULL;
						$txtLen = $pdf->GetStringWidth($txt);
						$milieu = (210-$txtLen)/2;
						$pdf->SetX($milieu);
						$pdf->Write(5,$txt);
						//เขียนที่
						$pdf->ln(7);
						$txt = "เขียนที่ภาควิชาวิศวกรรมคอมพิวเตอร์";
						$pdf->MultiCell(0,$InterLigne,$txt,0,'R',0,0); 
						//วันที่
						$pdf->ln(2);
						$txt = "วันที่ $data_date";
						$pdf->MultiCell(0,$InterLigne,$txt,0,'R',0,0); 
						//เรื่อง
						$pdf->ln(2);
						$txt = "เรื่อง $d2";
						$pdf->MultiCell(0,$InterLigne,$txt,0,'J',0,15); 
						//เรียน
						$pdf->ln(3);
						$txt = "เรียน  คณบดี คณะวิศวกรรมศาตร์";
						$pdf->MultiCell(0,$InterLigne,$txt,0,'J',0,15); 
						//วรรคแรก
						$sum=$d1+10;
						$pdf->ln(3);	
						$txt=" 		   ข้าพเจ้า  $user_name   ตำแหน่ง  $position_user ระดับ $re_level  ภาควิชาวิศวกรรมคอมพิวเตอร์  คณะวิศวกรรมศาสตร์ เกิดวันที่  $d31 เดือน $d32 พ.ศ. $d33 เข้ารับราชการเมื่อวันที่ $d34 เดือน $d35 พ.ศ. $d36 
ปัจจุบันได้รับเงินเดือนๆ ละ $d37 บาท มีความประสงค์จะ $d2 ณ. ประเทศ $d41  ตั้งแต่วันที่  $d4 เดือน $d5 พ.ศ. $d6 ถึงวันที่ $d7 เดือน $d8 พ.ศ. $d9 ด้วยทุน $d42 มีกำหนด $d43 ปี $d44 เดือน $d45 วัน";
						$pdf->MultiCell(0,$InterLigne,$txt,0,'J',0,10);  
						$txt="						ครั้งสุดท้ายข้าพเจ้าได้ลา  $d2 ตั้งแต่วันที่ $d12 เดือน $d13 พ.ศ. $d14 ถึงวันที่ $d15 เดือน $d16 พ.ศ. $d17 ";
						$pdf->MultiCell(0,$InterLigne,$txt,0,'J',0,10); 
						$txt="				ข้าพเจ้าขอรับรองว่าจะปฎิบัติจะปฎิบัติามระเบียบของทางราชาการว่าด้วยการไปศึกษา ผึกอบรม ดูงาน หรือปฎิบัติการวิจัย ทุกประการ";
						$pdf->MultiCell(0,$InterLigne,$txt,0,'J',0,10); 		
						
						//คำลงท้าย
						$pdf->ln(10);
						$txt ="ขอแสดงความนับถือ";
						$pdf->MultiCell(190,$InterLigne,$txt,0,'C',0); 
						//ลงชื่อ
						$pdf->ln(10);
						$txt ="( $user_name)";
						$pdf->MultiCell(190,$InterLigne,$txt,0,'C',40,0); 
						
						//ผู้บังคับบัญชา และคำสั่ง
						$pdf->ln(3);
						$txt = "ความเห็นผู้บังคับบัญชา                                                      												คำสั่ง";
						$pdf->MultiCell(0,$InterLigne,$txt,0,'J',0,0); 
						$pdf->ln(1);
						$txt = "(  )อนุญาต    (  )ไม่อนุญาต                                                          							(  )อนุญาต    (  )ไม่อนุญาต";
						$pdf->MultiCell(170,$InterLigne,$txt,0,'J',0,0); 
						$pdf->ln(1);
						$txt = "........................................................................                       						...........................................................................";
						$pdf->MultiCell(170,$InterLigne,$txt,0,'J',0,0); 
						$pdf->ln(1);
						$txt = "........................................................................                     							............................................................................";
						$pdf->MultiCell(170,$InterLigne,$txt,0,'J',0,0); 
						$pdf->ln(1);
						$txt = "..............ดร.วัชระ ฉัตรวิรัยะ..........................                        						(ลงชื่อ).................................................................";
						$pdf->MultiCell(170,$InterLigne,$txt,0,'J',0,0); 
						$pdf->ln(1);
						$txt = "......หัวหน้าภาควิชาวิศวกรรมคอมพิวเตอร์ .....                        							..........คณะบดี คณะวิศวกรรมศาสตร๋..........";
						$pdf->MultiCell(170,$InterLigne,$txt,0,'J',0,0); 
						$pdf->ln(1);
						$txt = "วันที่................./........................../..................                        							วันที่................./........................../....................";
						$pdf->MultiCell(170,$InterLigne,$txt,0,'J',0,0); 
						$pdf->ln(1);
						//$txt = "							สถิติการลาในงบประมาณนี้";
						//$pdf->MultiCell(170,$InterLigne,$txt,0,'J',0,0); 
						//$pdf->Cell(20,10,'Title',1,1,'C'); 

$pdf->Output();
?> 
