<%@ page contentType="text/html; charset=windows-874" language="java" import="java.sql.*" errorPage="" %>
<html>
<head>
<title>Untitled Document</title>
<meta http-equiv="Content-Type" content="text/html; charset=windows-874">
</head>

<body>
<div align="center">
        <p>&nbsp;</p>
        <p><strong>ความสําคัญและที่มาของระบบบริการเครือข่ายห้องสมุดห้องสมุด</strong></p>
</div>
<p> เนื่องจากในปัจจุบัน ห้องสมุดของสถาบันอุดมศึกษาส่วนใหญ่จะใช้ระบบบริหาร และจัดการงานบริการโดยซื้อ 
        Software มาจากต่างประเทศซึ่งมีหลากหลายผลิตภัณฑ์ ซึ่งมีความครบถ้วนและประสิทธิภาพที่สูงก็ตามแต่เนื่องจากมีราคาที่สูงมากตามไปด้วย 
        ประกอบกับการขยายตัวของสถาบันต่างๆ มีผลทำให้เมื่อถึงจุดหนึ่งจะเกินขีดจำกัดของซอฟแวร์และ 
        เพื่อเป็นการเปิดโอกาสให้สถานศึกษาที่มีความประสงค์จะเสนองานบริการในรูปแบบที่เป็นมาตรฐานแต่ขาดแคลนทุนทรัพย์</p>
<p> ในปัจจุบันการติดต่อในงานบริการระหว่างห้องสมุดเช่น การสืบค้นไประหว่างสถานศึกษาอื่น 
        ยังต้องติดต่อแต่ละที่เอง เนื่องจากมีหลากหลายผลิตภัณฑ์ทำให้การที่จะทำงานรวมกันเป็นไปได้อยาก 
        โดยต้องออกจากระบบห้องสมุดของตนก่อนถึงจะทำการติดต่อกับที่อื่นได้ นั้นทำให้การใช้งานระบบบริการห้องสมุดไม่สะดวกต่อผู้ใช้นัก 
        จึงเกิดความคิดที่จะพัฒนาระบบบริการห้องสมุด ที่ใช้มาตรฐานเดียวกันในการติดต่อแลกเปลี่ยนข้อมูล 
        และสามารถทำการพัฒนาระบบได้ด้วยตัวเอง</p>
<p> และยังเป็นการเปิดโอกาสให้กับองค์กรหรือหน่วยงานอื่นที่มีความประส่งที่จะแบ่งปันและกระจายสื่อสารนิเทศที่ตนมีอยู่ 
        ด้วยเหตุนี้แล้วแหล่งข้อมูลที่มีอยู่อย่างมากมายและกระจัดกระจ่ายจะสามารถรวมกันและสามารถให้บริการต่อสาธารณะได้อย่างสะดวก 
        และไม่ต้องเสียค่าใช้จ่ายเป็นจำนวนมากในการสร้างและพัฒนาระบบ </p>
<p>&nbsp;</p>
<p align="center"><strong>วัตถุประสงค์ของโครงงาน</strong></p>
<p align="left"> 1. เพื่อศึกษาและพัฒนางานบริการห้องสมุดให้ดีมากขึ้น<br>
        2. เพื่อพัฒนาแนวคิดในการนำ Web service มาใช้ในการแก้ปัญหาการไม่เข้ากันของระบบที่ห้องสมุดที่แต่ละที่ใช้<br>
        3. เพื่อเป็นแนวทางในการพัฒนาระบบห้องสมุดในอนาคต<br>
        4. เพื่อเป็นการพัฒนาระบบบริการห้องสมุดที่มีราคาถูก</p>
<p align="left">&nbsp;</p>
<p align="center"><strong>ขอบเขตของโครงงาน</strong></p>
<p align="left">1. ศึกษาการทำงานของระบบห้องสมุดที่มีอยู่ในปัจจุบัน<br>
        2. ศึกษาเทคโนโลยีของเว็บเซอร์วิส<br>
        3. ออกแบบและสร้างระบบบริการห้องสมุดโดยใช้หลักการของเว็บเซอร์วิส<br>
        4. ทดสอบการใช้งานร่วมกับบริการอื่นที่สร้างขึ้นมาตามหลักการของเว็บเซอร์วิส<br>
        5. จัดทำคู่มือระบบและคู่มือการใช้งาน<br>
        <br>
</p>
</body>
</html>
