<html>
<head>
<title>วิธีการใช้งาน</title>
<meta http-equiv="Content-Type" content="text/html; charset=windows-874">
<link href="style.css" rel="stylesheet" type="text/css">
</head>

<body>
<table width="620" border="1" cellpadding="0" cellspacing="0" bordercolor="#9999FF" class="normal" align="center">
  <tr> 
    <td width="100%"  class="title"><p>&nbsp;&nbsp;&nbsp;การใช้งาน</p></td>
  </tr>
  <tr> 
    <td bordercolor="#FFFFFF"><ol>
        <li>เมื่อท่านยังไม่ได้เป็นสมาชิกต้องสมัครสมาชิกก่อนใช้งาน</li>
        <li>ท่านสามารถสมัครสมาชิกได้ 2 แบบ คือ เป็นอาจารย์หรือเป็นนักเรียน</li>
        <li>เมื่อท่านสมัครสมาชิกท่านจะมี username และ password สำหรับที่จะใช้ในการ 
          login เข้าระบบ</li>
        <li>ในการประกาศข่าวนั้นผู้ที่สามารถประกาศได้ คือ อาจารย์หรือผู้ดูแลระบบ 
          เท่านั้น</li>
        <li>ในการออกจากระบบ กรุณา logout ด้วย</li>
      </ol></td>
  </tr>
  <tr> 
    <td><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;<strong>อาจารย์ </strong></font></td>
  </tr>
  <tr> 
    <td bordercolor="#FFFFFF"><ol start="6">
        <li>ในการสมัครเป็นอาจารย์ท่านต้องสร้างบทเรียนและแบบทดสอบด้วย</li>
        <li>ในการสร้างบทเรียนท่านต้องกำหนดรูปแบบการสอนให้ชัดเจน</li>
        <li>ในการสร้างบทเรียนท่านสามารถนำ file หรือ ข้อมูลที่มีอยู่ลงมายังระบบได้</li>
        <li>ในการสร้างแบบทดสอบนั้นสามารถกำหนดความต้องการในการสร้างข้อสอบได้</li>
        <li>ในการสร้างแบบทดสอบนั้นท่านต้องทำเฉลยข้อสอบที่ถูกไว้ด้วย</li>
      </ol></td>
  </tr>
  <tr> 
    <td bordercolor="#9999FF"><font color="#3333FF">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>นักเรียน 
      </strong></font> </td>
  </tr>
  <tr> 
    <td bordercolor="#FFFFFF" ><ol start="11">
        <li>ในการสมัครเป็นนักเรียนท่านสามารถเลือกเรียนวิชาไหนก็ได้ที่มีการเปิดสอน</li>
        <li>ในการเรียนในแต่ละวิชาท่านต้องลงทะเบียนเรียนวิชานั้นๆก่อนถึงจะสามารถเข้าเรียนวิชานั้นได้</li>
        <li>ในการเรียนในแต่ละวิชา รูปแบบการเรียนจะขึ้นอยู่กับอาจารย์ว่าต้องการให้เป็นรูปแบบไหน</li>
        <li>ในการเรียนในแต่ละวิชาเมื่อเรียนเสร็จแล้ว กรุณาทำแบบประเมินผลการสอนด้วย</li>
        <li>ในแต่ละวิชาที่ได้ลงทะเบียนเรียนไว้ ท่านสามารถถอนการลงทะเบียนเรียนได้ทุกเวลา</li>
      </ol></td>
  </tr>
</table>
</body>
</html>
