<?
function censor($text)
{
$word = array("ashole","a s h o l e","a.s.h.o.l.e","bitch","b i t c h","b.i.t.c.h","shit","s h i t","s.h.i.t","fuck","dick","f u c k","d i c k","f.u.c.k","d.i.c.k","ÁÖ§","ÁÖ §","¡Ù","¤ÇÂ","¤ Ç Â","¤.Ç.Â","»Õé","àËÕéÂ","àÎÕéÂ","ªÒµÔËÁÒ","ªÒ´ËÁÒ","ª Ò ´ Ë Á Ò","ª.Ò.´.Ë.Á.Ò","ª Ò µÔ Ë Á Ò","ª.Ò.µÔ.Ë.Á.Ò","äÍé","ÊÑ´ËÁÒ","ÊÑ´","àÂç´","ËÕ","¢Õé","ÊÑµÇì","äÍéÊÑµÇì","¤ÃÇÂ","äÍé¤ÇÒÂ","äÍéºéÒ","ä»µÒÂ«Ð","ËÁÍÂ"
,"ÁÖ§","ËÓ","¾èÍµÒÂ","áÁèµÒÂ","ÍÕ´Í¡","äÍéàªÕèÂ","äÍéàËÕéÂ","äÍéÊÑ´","ÍÕÊÑ´","ÍÕÊÑµÇì","â¤µÃ¾èÍ","â¤ÃµÃáÁè","áµ´",
"¡Ð´Í","Êé¹µÕ¹","¨ÃÃÅÑÂ","¨Ñ¹ÅÑÂ","µÕ¹","äÍéËèÒ","ÍÕËèÒ"
);
	$ban = "<font color=red>***</font>";
	for ($i=0 ; $i<sizeof($word) ; $i++) {
		$text = eregi_replace($word[$i],$ban,$text);
		}
return($text);
}

?>