// -------------------------------------------------ภาควิชา ภาษาไทย --------------------------------------------------------------
		// ให้เลือก
var d_00_th=new Array();   //thai
	d_00_th[0]=new Option("เลือก               ","00");

		//  ภาควิชาใน คณะวิศวกรรมศาสตร์
var d_01_th=new Array();		// thai
	d_01_th[0]=new Option("วิศวกรรมไฟฟ้า","01");
	d_01_th[1]=new Option("วิศวกรรมระบบควบคุม","02");
	d_01_th[2]=new Option("วิศวกรรมเครื่องกล","03");
	d_01_th[3]=new Option("วิศวกรรมอิเล็กทรอนิกส์","04");
	d_01_th[4]=new Option("วิศวกรรมเคมี","05");
	d_01_th[5]=new Option("เทคโนโลยีการวัดคุมทางอุตสาหกรรม ","06");
	d_01_th[6]=new Option("วิศวกรรมคอมพิวเตอร์","07");
	d_01_th[7]=new Option("วิศวกรรมเกษตร","08");
	d_01_th[8]=new Option("วิศวกรรมโทรคมนาคม","09");
	d_01_th[9]=new Option("วิศวกรรมเทคนิคอุตสาหกรรม","10");
		
		// ภาควิชาใน คณะสถาปัตยกรรมศาสตร์
var d_02_th=new Array();		// thai
	d_02_th[0]=new Option("การวางแผนภาคและเมือง","01");
	d_02_th[1]=new Option("สถาปัตยกรรม","02");
	d_02_th[2]=new Option("สถาปัตยกรรมภายใน","03");
	d_02_th[3]=new Option("ศิลปอุตสาหกรรม","04");
	
	// ภาควิชาใน คณะครุศาสตร์อุสาหกรรม
var d_03_th=new Array();		// thai
	d_03_th[0]=new Option("ครุศาสตร์อุตสาหกรรม","01");
	d_03_th[1]=new Option("ครุศาสตร์สถาปัตยกรรม","02");
	d_03_th[2]=new Option("ครุศาสตร์เกษตร","03");
	d_03_th[3]=new Option("ภาษาและสังคม","04");
	d_03_th[4]=new Option("ครุศาสตร์วิศวกรรม","05");

	// ภาควิชาใน คณะวิทยาศาสตร์
var d_04_th=new Array();		// thai
	d_04_th[0]=new Option("ฟิสิกส์ประยุกต์","01");
	d_04_th[1]=new Option("ชีววิทยาประยุกต์","02");
	d_04_th[2]=new Option("เคมี","03");
	d_04_th[3]=new Option("คณิตศาสตร์และวิทยาการคอมพิวเตอร์","04");
	d_04_th[4]=new Option("สถิติประยุกต์","05");

	// ภาควิชาใน คณะเทคโนโลยีการเกษตร
var d_05_th=new Array();		// thai
	d_05_th[0]=new Option("เทคโนโลยีการจัดการศัตรูพืช","01");
	d_05_th[1]=new Option("เทคโนโลยีการผลิตสัตว์","02");
	d_05_th[2]=new Option("เทคโนโลยีการผลิตพืช","03");
	d_05_th[3]=new Option("ปฐพีวิทยา","04");
	d_05_th[4]=new Option("บริหารธุรกิจเกษตร","05");

	// ภาควิชาใน คณะโครงการคณะอุสาหกรรมเกษตร
var d_06_th=new Array();		// thai
	  d_06_th[0]=new Option("อุตสาหกรรมเกษตร ","01");
	
   // ภาควิชาใน คณะเทคโนโลยีสารสนเทศ
var d_07_th=new Array();		// thai
	d_07_th[0]=new Option("ไม่มี              ","01");

//  --------------------------สาขาวิชาภาษาไทย ไม่แยก โท เอก ---//thai------------------------------------------------
			// ให้เลือก
	var m0000=new Array();   
		  m0000[0]=new Option("เลือก             ","00000");
	// สาขาวิชา คณะวิศวกรรมศาสตร์
	var m0101=new Array();
		  m0101[0]=new Option("วิศวกรรมไฟฟ้า","01011");
	var m0102=new Array();	
		  m0102[0]=new Option("วิศวกรรมระบบควบคุม","01021");
	var m0103=new Array();
		  m0103[0]=new Option("วิศวกรรมเครื่องกล","01031");
	var m0104=new Array();
		  m0104[0]=new Option("วิศวกรรมอิเล็กทรอนิกส์","01041");
		  m0104[1]=new Option("วิศวกรรมไมโครอิเล็กทรอนิกส์","01042");
	var m0105=new Array();
		  m0105[0]=new Option("วิศวกรรมปิโตรเคมี","01051");
	var m0106=new Array();
		  m0106[0]=new Option("วิศวกรรมการวัดคุม","01061");
	var m0107=new Array();
		  m0107[0]=new Option("วิศวกรรมคอมพิวเตอร์","01071");
	var m0108=new Array();
		  m0108[0]=new Option("วิศวกรรมเกษตร","01081");
	var m0109=new Array();
		  m0109[0]=new Option("วิศวกรรมโทรคมนาคม","01091");
	var m0110=new Array();
		  m0110[0]=new Option("วิศวกรรมสารสนเทศ","01101");
	
	// สาขาวิชา คณะสถาบัตยกรรมศาสตร์
	var m0201=new Array();
		  m0201[0]=new Option("การวางแผนชุมชนเมืองและสภาพแวดล้อม(นานาชาติ)","02011");
		  m0201[1]=new Option("การวางแผนชุมชนเมืองและสภาพแวดล้อม","02012");
   var m0202=new Array();
		  m0202[0]=new Option("สถาปัตยกรรมเขตร้อน","02021");	
	var m0203=new Array();
		  m0203[0]=new Option("สถาปัตยกรรมภายใน","02031");
	var m0204=new Array();
		  m0204[0]=new Option("ศิลปอุตสาหกรรม","02041");	

	// สาขาวิชา คณะครุศาสตร์อุตสาหกรรม	
	var m0301=new Array();
		  m0301[0]=new Option("การบริหารอาชีวศึกษา","03011");
		  m0301[1]=new Option("การศึกษาวิทยาศาสตร์","03012");
		  m0301[2]=new Option("เทคโนโลยีการศึกษาทางการอาชีวะและเทคนิคศึกษา","03013");
		  m0301[3]=new Option("หลักสูตรและการสอนอาชีวศึกษา","03014");
	var m0302=new Array();
		  m0302[0]=new Option("สถาปัตยกรรม","03021");
		  m0302[1]=new Option("เทคโนโลยีผลิตภัณฑ์อุตสาหกรรม","03022");
	var m0303=new Array();
		  m0303[0]=new Option("ครุศาสตร์เกษตร","03031");
	var m0304=new Array();
		  m0304[0]=new Option("วิทยาการจัดการอุตสาหกรรม","03041");
		  m0304[1]=new Option("ภาษาศาสตร์ประยุกต์-ภาษาอังกฤษเพื่อวิทยาศาสตร์และเทคโนโลยี","03042");
	var m0305=new Array();
		  m0305[0]=new Option("วิศวกรรมไฟฟ้าสื่อสาร","03051");

	// สาขาวิชา คณะวิทยาศาสตร์
	var m0401=new Array();
		  m0401[0]=new Option("ฟิสิกส์ประยุกต์","04011");
		  m0401[1]=new Option("มาตรวิทยา","04012");
	var m0402=new Array();
		  m0402[0]=new Option("เทคโนโลยีชีวภาพ","04021");
	var m0403=new Array();
		  m0403[0]=new Option("เคมีประยุกต์","04031");
		  m0403[1]=new Option("เคมี","04032");
		  m0403[2]=new Option("เทคโนโลยีพอลิเมอร์","04033");
		  m0403[3]=new Option("ปิโครเคมีและเคมีของไฮโครคาร์บอน","04034");
		  m0403[4]=new Option("เคมีสิ่งแวดล้อม","04035");
	var m0404=new Array();
		  m0404[0]=new Option("คณิตศาสตร์ประยุกต์","04041");
		  m0404[1]=new Option("วิทยาการคอมพิวเตอร์","04042");
	var m0405=new Array();
		  m0405[0]=new Option("สถิติประยุกต์","04051");

		  
	// สาขาวิชา คณะเทคโนโลยีการเกษตร
	var m0501=new Array();
		  m0501[0]=new Option("เทคโนโลยีชีวภาพทางโรคพืช(นานาชาติ)","05011");
		  m0501[1]=new Option("เทคโนโลยีการจัดการศัตรูพ์ช","05012");
  		  m0501[2]=new Option("กีฏวิทยาและสิ่งแวดล้อม","05013");
	var m0502=new Array();
		  m0502[0]=new Option("สัตวศาสตร์","05021");
	var m0503=new Array();
		  m0503[0]=new Option("พืชไร่","05031");
		  m0503[1]=new Option("พืชสวน","05032");
	var m0504=new Array();
		  m0504[0]=new Option("ปฐพีวิทยา","05041");
	var m0505=new Array();
		  m0505[0]=new Option("บริหารธุรกิจ","05051");
		  m0505[1]=new Option("การจัดการธุรกิจเกษตรและอุตสาหกรรมอาหาร","05052");
	
	// สาขาวิชา โครงการคณะอุสาหกรรมเกษตร
	var m0601=new Array();
		  m0601[0]=new Option("วิทยาศาสตร์การอาหาร(นานาชาติ)","06011");
		  m0601[1]=new Option("วิทยาศาสตร์การอาหาร","06012");
		  m0601[2]=new Option("สุขาภิบาลอาหาร","06013");
	
	// สาขาวิชา คณะเทคโนโลยีสานสนเทศ
	var m0701=new Array();
		  m0701[0]=new Option("เทคโนโลยีสารสนเทศ","07011");

	// end สาขาวิชา -----------------------------------------------------------------------




	department=null;
	m=null;

//---------------------------------------- Function ---------------------------------------------
	function init(faculty,dept){
			// เปลี่ยน list ภาควิชา
			tmp=eval("d_"+faculty.value+"_th");
			dept.length=0;
			for(i=0; i<tmp.length; i++)dept.options[i]=tmp[i];
			dept.options[0].selected=true;			
	}
	//  end init -------------------------------------------------------------------------------------


	// ****** function เปลี่ยนชื่อ ภาควิชา	
		function departmentChange(faculty,dept){			
			tmp=eval("d_"+faculty.value+"_th");
			dept.length=0;
			for(i=0; i<tmp.length; i++)dept.options[i]=tmp[i];
			dept.options[0].selected=true;
		}


