
			//******************************* script 1 ***************************************//


//----------------------------------------------------------- ชื่อคณะภาษาอังกฤษ----------------------------------------------------
var f00_en ="";

var f01_en ="Engineering";
var f02_en ="Architecture";
var f03_en ="Industrial Education";
var f04_en ="Science";
var f05_en ="Agricultural Technology";
var f06_en ="Agricultural Industrial";
var f07_en ="Information Technology";

// ------------------------------------------------------------ชื่อภาคภาษาอังกฤษ-------------------------------------------------------
var d0000_en ="";

// ภาควิชาภาษาอังกฤษใน คณะวิศวกรรมศาสตร์
var d0101_en ="Electrical Engineering";
var d0102_en ="Contorl Engineering";
var d0103_en ="Mechanical Engineering";
var d0104_en ="Electronics Engineering";
var d0105_en ="Chemical Engineering";
var d0106_en ="Instrumentation Engineering";
var d0107_en ="Computer Engineering";
var d0108_en ="Agricultural Engineering";
var d0109_en ="Telecommunication Engineering";
var d0110_en ="Industrial Technology";


// ภาควิชาภาษาอังกฤษใน คณะครุศาสตร์อุตสาหกรรม
var d0201_en ="Urban Regional Planning";
var d0202_en ="Architecture";
var d0203_en ="Interior Architecture";
var d0204_en ="Industrial Design";

// ภาควิชาภาษาอังกฤษใน คณะสถาปัตยกรรมศาสตร์
var d0301_en ="Industrial Education";
var d0302_en ="Architectural Education";
var d0303_en ="Agricultural Education";
var d0304_en ="Languages and Social Science";
var d0305_en ="Engineering Education";

// ภาควิชาภาษาอังกฤษใน คณะวิทยาศาสตร์
var d0401_en ="Applied Physics";
var d0402_en ="Applied Biology";
var d0403_en ="Chemistry";
var d0404_en ="Mathematics and Computer Science";
var d0405_en ="Applied Statistics";

// ภาควิชาภาษาอังกฤษใน คณะวิทยาศาสตร์
var d0501_en ="Plant Pest Management technology";
var d0502_en ="Animal Production Technology";
var d0503_en ="ผลิตพืช";
var d0504_en ="Soil Science";
var d0505_en ="Agricultural Business Administration";

// ภาควิชาภาษาอังกฤษใน คณะวิทยาศาสตร์
var d0601_en ="Agricultural Industry";



// ภาควิชาภาษาอังกฤษใน คณะเทคโนโลยีสารสนเทศ
var d0701_en ="non";

//  --------------------------สาขาวิชาภาษาอังกฤษ ไม่แยก โท เอก ---//english----------------------------------------------
	var m00000= "";
// -- สาขาวิชาคณะวิศวกรรมศาสตร์  
 	var m01011="Electrical Engineering";
	var m01021="Control Engineering";
	var m01031="Mechanical Engineering";
	var m01041="Electronics Engineering";
	var m01042="Microelectronic Engineering";
	var m01051="Petrochemical Engineering";
	var m01061="Instrumentation Engineering";
	var m01071="Computer Engineering";
	var m01081="Agricultural Engineering";
	var m01091="Telecommunication Engineering";
	var m01101="Information Engineering";

// -- สาขาวิชาคณะสถาปัตยกรรมศาสตร์
	var m02011="Urban and Environmental Planning(Inter)";
	var m02012="Urban and Environmental Planning";
	var m02021="Tropical Architecture";
	var m02031="Interior Architecture";
	var m02041="Industrial Design";

// -- สาขาวิชาคณะครุศาสตร์อุตสาหกรรม
	var m03011="Vocational Education Administration";
	var m03012="Science Education";
	var m03013="Education Technology in Vocational and Technical Education";
	var m03014="Vocational Curriculum and Instruction";
	var m03021="Architecture";
	var m03022="Industrial Design Technology";
	var m03031="Agricultural Education";
	var m03041="Industrial Management";
	var m03042="Applied Linguistics-English for Science and Technology";
	var m03051="Electrical Communications Engineering";

// -- สาขาวิชาคณะวิทยาศาสตร์
	var m04011="Applied Physics";
	var m04012="Metrology";
	var m04021="Biotechnology";
	var m04031="Applied Chemistry";
	var m04032="Chemistry";
	var m04033="Polymer Technology";
	var m04034="Petrochemicals and Hydrocarbon Chemistry";
	var m04035="Environmental Chemistry";
	var m04041="Applied Mathematics";
	var m04042="Computer Science";

// -- สาขาวิชาคณะเทคโนโลยีการเกษตร
	var m05011="Biotechnology in Plant Pathology";
	var m05012="Plant Pest Management Technology";
	var m05013="Entomology and Environment";
	var m05021="Animal Science";
	var m05031="Agronomy";
	var m05032="Horticulture";
	var m05041="Soil Science";
	var m05051="Business Administration";
	var m05052="Agribusiness and Food Industry Management";

// -- สาขาวิชา โครงการคณะอุตสาหกรรมเกษตร
	var m06011="Food Science(Inter)";
	var m06012="Food Science";
	var m06013="Food Sanitation";

// -- สาขาวิชา โครงการคณะอุตสาหกรรมเกษตร
	var m07011="Information Technology";


// ******************************* ภาควิชา ภาษาไทย *******************************************
		// ให้เลือก
var d00th=new Array();   //thai
	  d00th[0]=new Option("เลือก","00");

		//  ภาควิชาใน คณะวิศวกรรมศาสตร์
var d01th=new Array();		// thai
	  d01th[0]=new Option("วิศวกรรมไฟฟ้า","01");
	  d01th[1]=new Option("วิศวกรรมระบบควบคุม","02");
	  d01th[2]=new Option("วิศวกรรมเครื่องกล","03");
	  d01th[3]=new Option("วิศวกรรมอิเล็กทรอนิกส์","04");
	  d01th[4]=new Option("วิศวกรรมเคมี","05");
	  d01th[5]=new Option("เทคโนโลยีการวัดคุมทางอุตสาหกรรม ","06");
	  d01th[6]=new Option("วิศวกรรมคอมพิวเตอร์","07");
	  d01th[7]=new Option("วิศวกรรมเกษตร","08");
	  d01th[8]=new Option("วิศวกรรมโทรคมนาคม","09");
	  d01th[9]=new Option("วิศวกรรมเทคนิคอุตสาหกรรม","10");
		
		// ภาควิชาใน คณะสถาปัตยกรรมศาสตร์
var d02th=new Array();		// thai
	  d02th[0]=new Option("การวางแผนภาคและเมือง","11");
	  d02th[1]=new Option("สถาปัตยกรรม","12");
	  d02th[2]=new Option("สถาปัตยกรรมภายใน","13");
	  d02th[3]=new Option("ศิลปอุตสาหกรรม","14");
	
	// ภาควิชาใน คณะครุศาสตร์อุสาหกรรม
var d03th=new Array();		// thai
	  d03th[0]=new Option("ครุศาสตร์อุตสาหกรรม","15");
	  d03th[1]=new Option("ครุศาสตร์สถาปัตยกรรม","16");
	  d03th[2]=new Option("ครุศาสตร์เกษตร","17");
	  d03th[3]=new Option("ภาษาและสังคม","18");
	  d03th[4]=new Option("ครุศาสตร์วิศวกรรม","19");

	// ภาควิชาใน คณะวิทยาศาสตร์
var d04th=new Array();		// thai
	  d04th[0]=new Option("ฟิสิกส์ประยุกต์","20");
	  d04th[1]=new Option("ชีววิทยาประยุกต์","21");
	  d04th[2]=new Option("เคมี","22");
	  d04th[3]=new Option("คณิตศาสตร์และวิทยาการคอมพิวเตอร์","23");
	  d04th[4]=new Option("สถิติประยุกต์","24");

	// ภาควิชาใน คณะเทคโนโลยีการเกษตร
var d05th=new Array();		// thai
	  d05th[0]=new Option("เทคโนโลยีการจัดการศัตรูพืช","25");
	  d05th[1]=new Option("เทคโนโลยีการผลิตสัตว์","26");
	  d05th[2]=new Option("เทคโนโลยีการผลิตพืช","27");
	  d05th[3]=new Option("ปฐพีวิทยา","28");
	  d05th[4]=new Option("บริหารธุรกิจเกษตร","29");

	// ภาควิชาใน คณะโครงการคณะอุสาหกรรมเกษตร
var d06th=new Array();		// thai
	  d06th[0]=new Option("อุตสาหกรรมเกษตร","30");
	
   // ภาควิชาใน คณะเทคโนโลยีสารสนเทศ
var d07th=new Array();		// thai
	  d07th[0]=new Option("ไม่มี","31");



//  --------------------------สาขาวิชาภาษาไทย ไม่แยก โท เอก ---//thai------------------------------------------------

			// ให้เลือก		faculty+department
	var m0000=new Array();   
		  m0000[0]=new Option("เลือก","00");
	// สาขาวิชา คณะวิศวกรรมศาสตร์
	var m0101=new Array();
		  m0101[0]=new Option("วิศวกรรมไฟฟ้า","01");
	var m0102=new Array();	
		  m0102[0]=new Option("วิศวกรรมระบบควบคุม","02");
	var m0103=new Array();
		  m0103[0]=new Option("วิศวกรรมเครื่องกล","03");
	var m0104=new Array();
		  m0104[0]=new Option("วิศวกรรมอิเล็กทรอนิกส์","04");
		  m0104[1]=new Option("วิศวกรรมไมโครอิเล็กทรอนิกส์","12");
	var m0105=new Array();
		  m0105[0]=new Option("วิศวกรรมปิโตรเคมี","05");
		  m0105[1]=new Option("วิศวกรรมเคมี","07");
	var m0106=new Array();
		  m0106[0]=new Option("วิศวกรรมการวัดคุม","06");
	var m0107=new Array();
		  m0107[0]=new Option("วิศวกรรมคอมพิวเตอร์","08");
	var m0108=new Array();
		  m0108[0]=new Option("วิศวกรรมเกษตร","09");
	var m0109=new Array();
		  m0109[0]=new Option("วิศวกรรมโทรคมนาคม","10");
	var m0110=new Array();
		  m0110[0]=new Option("วิศวกรรมสารสนเทศ","11");
			 


	// สาขาวิชา คณะสถาบัตยกรรมศาสตร์
	var m0211=new Array();
		  m0211[0]=new Option("การวางแผนชุมชนเมืองและสภาพแวดล้อม","13");
   var  m0212=new Array();
		  m0212[0]=new Option("สถาปัตยกรรมเขตร้อน","14");	
	var m0213=new Array();
		  m0213[0]=new Option("สถาปัตยกรรมภายใน","15");
	var m0214=new Array();
		  m0214[0]=new Option("ศิลปอุตสาหกรรม","16");	

	// สาขาวิชา คณะครุศาสตร์อุตสาหกรรม	
	var m0315=new Array();
		  m0315[0]=new Option("การบริหารอาชีวศึกษา","17");
		  m0315[1]=new Option("การศึกษาวิทยาศาสตร์","19");
		  m0315[2]=new Option("เทคโนโลยีการศึกษาทางการอาชีวะและเทคนิคศึกษา","22");
		  m0315[3]=new Option("หลักสูตรและการสอนอาชีวศึกษา","23");
	var m0316=new Array();
		  m0316[0]=new Option("สถาปัตยกรรม","18");
		  m0316[1]=new Option("เทคโนโลยีผลิตภัณฑ์อุตสาหกรรม","25");
	var m0317=new Array();
		  m0317[0]=new Option("ครุศาสตร์เกษตร","20");
	var m0318=new Array();
		  m0318[0]=new Option("วิทยาการจัดการอุตสาหกรรม","21");
		  m0318[1]=new Option("ภาษาศาสตร์ประยุกต์-ภาษาอังกฤษเพื่อวิทยาศาสตร์และเทคโนโลยี","26");
	var m0319=new Array();
		  m0319[0]=new Option("วิศวกรรมไฟฟ้าสื่อสาร","24");

	// สาขาวิชา คณะวิทยาศาสตร์
	var m0420=new Array();
		  m0420[0]=new Option("ฟิสิกส์ประยุกต์","27");
		  m0420[1]=new Option("มาตรวิทยา","35");
	var m0421=new Array();
		  m0421[0]=new Option("เทคโนโลยีชีวภาพ","28");
	var m0422=new Array();
		  m0422[0]=new Option("เคมีประยุกต์","29");
		  m0422[1]=new Option("เคมี","31");
		  m0422[2]=new Option("เทคโนโลยีพอลิเมอร์","33");
		  m0422[3]=new Option("ปิโครเคมีและเคมีของไฮโครคาร์บอน","34");
		  m0422[4]=new Option("เคมีสิ่งแวดล้อม","36");
	var m0423=new Array();
		  m0423[0]=new Option("คณิตศาสตร์ประยุกต์","30");
		  m0423[1]=new Option("วิทยาการคอมพิวเตอร์","37");
	var m0424=new Array();
		  m0424[0]=new Option("สถิติประยุกต์","32");

		  
	// สาขาวิชา คณะเทคโนโลยีการเกษตร
	var m0525=new Array();
		  m0525[0]=new Option("เทคโนโลยีชีวภาพทางโรคพืช","38");
		  m0525[1]=new Option("เทคโนโลยีการจัดการศัตรูพ์ช","42");
  		  m0525[2]=new Option("กีฏวิทยาและสิ่งแวดล้อม","44");
	var m0526=new Array();
		  m0526[0]=new Option("สัตวศาสตร์","39");
	var m0527=new Array();
		  m0527[0]=new Option("พืชไร่","40");
		  m0527[1]=new Option("พืชสวน","41");
	var m0528=new Array();
		  m0528[0]=new Option("ปฐพีวิทยา","43");
	var m0529=new Array();
		  m0529[0]=new Option("บริหารธุรกิจ","45");
		  m0529[1]=new Option("การจัดการธุรกิจเกษตรและอุตสาหกรรมอาหาร","46");
	
	// สาขาวิชา โครงการคณะอุสาหกรรมเกษตร
	var m0630=new Array();
		  m0630[0]=new Option("วิทยาศาสตร์การอาหาร","47");
		  m0630[1]=new Option("สุขาภิบาลอาหาร","48");
	
	// สาขาวิชา คณะเทคโนโลยีสานสนเทศ
	var m0731=new Array();
		  m0731[0]=new Option("เทคโนโลยีสารสนเทศ","49");

	// end สาขาวิชา -----------------------------------------------------------------------


//  --------------------------สาขาวิชาภาษาไทย เอาไว้เปลี่ยนตรง สอนในหลักสูตร 1---//thai------------------------------------------------

			// ให้เลือก		faculty+department
	var m100=new Array();   
		  m100[0]=new Option("เลือก","00");
	// สาขาวิชา คณะวิศวกรรมศาสตร์
	var m101=new Array();
		  m101[0]=new Option("วิศวกรรมไฟฟ้า","01");	
		  m101[1]=new Option("วิศวกรรมระบบควบคุม","02");
		  m101[2]=new Option("วิศวกรรมเครื่องกล","03");
		  m101[3]=new Option("วิศวกรรมอิเล็กทรอนิกส์","04");
		  m101[4]=new Option("วิศวกรรมไมโครอิเล็กทรอนิกส์","12");
		  m101[5]=new Option("วิศวกรรมปิโตรเคมี","05");
		  m101[6]=new Option("วิศวกรรมเคมี","07");
		  m101[7]=new Option("วิศวกรรมการวัดคุม","06");
		  m101[8]=new Option("วิศวกรรมคอมพิวเตอร์","08");
		  m101[9]=new Option("วิศวกรรมเกษตร","09");
		  m101[10]=new Option("วิศวกรรมโทรคมนาคม","10");
		  m101[11]=new Option("วิศวกรรมสารสนเทศ","11");			 

	// สาขาวิชา คณะสถาบัตยกรรมศาสตร์
	var m102=new Array();
		  m102[0]=new Option("การวางแผนชุมชนเมืองและสภาพแวดล้อม","13");
		  m102[1]=new Option("สถาปัตยกรรมเขตร้อน","14");	
		  m102[2]=new Option("สถาปัตยกรรมภายใน","15");
		  m102[3]=new Option("ศิลปอุตสาหกรรม","16");	

	// สาขาวิชา คณะครุศาสตร์อุตสาหกรรม	
	var m103=new Array();
		  m103[0]=new Option("การบริหารอาชีวศึกษา","17");
		  m103[1]=new Option("การศึกษาวิทยาศาสตร์","19");
		  m103[2]=new Option("เทคโนโลยีการศึกษาทางการอาชีวะและเทคนิคศึกษา","22");
		  m103[3]=new Option("หลักสูตรและการสอนอาชีวศึกษา","23");
		  m103[4]=new Option("สถาปัตยกรรม","18");
		  m103[5]=new Option("เทคโนโลยีผลิตภัณฑ์อุตสาหกรรม","25");
		  m103[6]=new Option("ครุศาสตร์เกษตร","20");
		  m103[7]=new Option("วิทยาการจัดการอุตสาหกรรม","21");
		  m103[8]=new Option("ภาษาศาสตร์ประยุกต์-ภาษาอังกฤษเพื่อวิทยาศาสตร์และเทคโนโลยี","26");
		  m103[9]=new Option("วิศวกรรมไฟฟ้าสื่อสาร","24");

	// สาขาวิชา คณะวิทยาศาสตร์
	var m104=new Array();
		  m104[0]=new Option("ฟิสิกส์ประยุกต์","27");
		  m104[1]=new Option("มาตรวิทยา","35");
		  m104[2]=new Option("เทคโนโลยีชีวภาพ","28");
		  m104[3]=new Option("เคมีประยุกต์","29");
		  m104[4]=new Option("เคมี","31");
		  m104[5]=new Option("เทคโนโลยีพอลิเมอร์","33");
		  m104[6]=new Option("ปิโครเคมีและเคมีของไฮโครคาร์บอน","34");
		  m104[7]=new Option("เคมีสิ่งแวดล้อม","36");
		  m104[8]=new Option("คณิตศาสตร์ประยุกต์","30");
		  m104[9]=new Option("วิทยาการคอมพิวเตอร์","37");
		  m104[10]=new Option("สถิติประยุกต์","32");

		  
	// สาขาวิชา คณะเทคโนโลยีการเกษตร
	var m105=new Array();
		  m105[0]=new Option("เทคโนโลยีชีวภาพทางโรคพืช","38");
		  m105[1]=new Option("เทคโนโลยีการจัดการศัตรูพ์ช","42");
  		  m105[2]=new Option("กีฏวิทยาและสิ่งแวดล้อม","44");
		  m105[3]=new Option("สัตวศาสตร์","39");
		  m105[4]=new Option("พืชไร่","40");
		  m105[5]=new Option("พืชสวน","41");
		  m105[6]=new Option("ปฐพีวิทยา","43");
		  m105[7]=new Option("บริหารธุรกิจ","45");
		  m105[8]=new Option("การจัดการธุรกิจเกษตรและอุตสาหกรรมอาหาร","46");
	
	// สาขาวิชา โครงการคณะอุสาหกรรมเกษตร
	var m106=new Array();
		  m106[0]=new Option("วิทยาศาสตร์การอาหาร","47");
		  m106[1]=new Option("สุขาภิบาลอาหาร","48");
	
	// สาขาวิชา คณะเทคโนโลยีสานสนเทศ
	var m107=new Array();
		  m107[0]=new Option("เทคโนโลยีสารสนเทศ","49");

	// end สาขาวิชา เอาไว้เปลี่ยนตรง สอนในหลักสูตร 1----------------------------------------------

//  --------------------------สาขาวิชาภาษาไทย เอาไว้เปลี่ยนตรง สอนในหลักสูตร 2---//thai------------------------------------------------

			// ให้เลือก		faculty+department
	var m200=new Array();   
		 m200[0]=new Option("เลือก","00");
	// สาขาวิชา คณะวิศวกรรมศาสตร์
	var m201=new Array();
		 m201[0]=new Option("วิศวกรรมไฟฟ้า","01");	
		 m201[1]=new Option("วิศวกรรมระบบควบคุม","02");
		 m201[2]=new Option("วิศวกรรมเครื่องกล","03");
		 m201[3]=new Option("วิศวกรรมอิเล็กทรอนิกส์","04");
		 m201[4]=new Option("วิศวกรรมไมโครอิเล็กทรอนิกส์","12");
		 m201[5]=new Option("วิศวกรรมปิโตรเคมี","05");
		 m201[6]=new Option("วิศวกรรมเคมี","07");
		 m201[7]=new Option("วิศวกรรมการวัดคุม","06");
		 m201[8]=new Option("วิศวกรรมคอมพิวเตอร์","08");
		 m201[9]=new Option("วิศวกรรมเกษตร","09");
		 m201[10]=new Option("วิศวกรรมโทรคมนาคม","10");
		 m201[11]=new Option("วิศวกรรมสารสนเทศ","11");			 

	// สาขาวิชา คณะสถาบัตยกรรมศาสตร์
	var m202=new Array();
		 m202[0]=new Option("การวางแผนชุมชนเมืองและสภาพแวดล้อม","13");
		 m202[1]=new Option("สถาปัตยกรรมเขตร้อน","14");	
		 m202[2]=new Option("สถาปัตยกรรมภายใน","15");
		 m202[3]=new Option("ศิลปอุตสาหกรรม","16");	

	// สาขาวิชา คณะครุศาสตร์อุตสาหกรรม	
	var m203=new Array();
		 m203[0]=new Option("การบริหารอาชีวศึกษา","17");
		 m203[1]=new Option("การศึกษาวิทยาศาสตร์","19");
		 m203[2]=new Option("เทคโนโลยีการศึกษาทางการอาชีวะและเทคนิคศึกษา","22");
		 m203[3]=new Option("หลักสูตรและการสอนอาชีวศึกษา","23");
		 m203[4]=new Option("สถาปัตยกรรม","18");
		 m203[5]=new Option("เทคโนโลยีผลิตภัณฑ์อุตสาหกรรม","25");
		 m203[6]=new Option("ครุศาสตร์เกษตร","20");
		 m203[7]=new Option("วิทยาการจัดการอุตสาหกรรม","21");
		 m203[8]=new Option("ภาษาศาสตร์ประยุกต์-ภาษาอังกฤษเพื่อวิทยาศาสตร์และเทคโนโลยี","26");
		 m203[9]=new Option("วิศวกรรมไฟฟ้าสื่อสาร","24");

	// สาขาวิชา คณะวิทยาศาสตร์
	var m204=new Array();
		 m204[0]=new Option("ฟิสิกส์ประยุกต์","27");
		 m204[1]=new Option("มาตรวิทยา","35");
		 m204[2]=new Option("เทคโนโลยีชีวภาพ","28");
		 m204[3]=new Option("เคมีประยุกต์","29");
		 m204[4]=new Option("เคมี","31");
		 m204[5]=new Option("เทคโนโลยีพอลิเมอร์","33");
		 m204[6]=new Option("ปิโครเคมีและเคมีของไฮโครคาร์บอน","34");
		 m204[7]=new Option("เคมีสิ่งแวดล้อม","36");
		 m204[8]=new Option("คณิตศาสตร์ประยุกต์","30");
		 m204[9]=new Option("วิทยาการคอมพิวเตอร์","37");
		 m204[10]=new Option("สถิติประยุกต์","32");

		  
	// สาขาวิชา คณะเทคโนโลยีการเกษตร
	var m205=new Array();
		 m205[0]=new Option("เทคโนโลยีชีวภาพทางโรคพืช","38");
		 m205[1]=new Option("เทคโนโลยีการจัดการศัตรูพ์ช","42");
  		 m205[2]=new Option("กีฏวิทยาและสิ่งแวดล้อม","44");
		 m205[3]=new Option("สัตวศาสตร์","39");
		 m205[4]=new Option("พืชไร่","40");
		 m205[5]=new Option("พืชสวน","41");
		 m205[6]=new Option("ปฐพีวิทยา","43");
		 m205[7]=new Option("บริหารธุรกิจ","45");
		 m205[8]=new Option("การจัดการธุรกิจเกษตรและอุตสาหกรรมอาหาร","46");
	
	// สาขาวิชา โครงการคณะอุสาหกรรมเกษตร
	var m206=new Array();
		 m206[0]=new Option("วิทยาศาสตร์การอาหาร","47");
		 m206[1]=new Option("สุขาภิบาลอาหาร","48");
	
	// สาขาวิชา คณะเทคโนโลยีสานสนเทศ
	var m207=new Array();
		  m207[0]=new Option("เทคโนโลยีสารสนเทศ","49");

	// end สาขาวิชา เอาไว้เปลี่ยนตรง สอนในหลักสูตร 2----------------------------------------------

	//  --------------------------สาขาวิชาภาษาไทย เอาไว้เปลี่ยนตรง สอนในหลักสูตร 3---//thai------------------------------------------------

			// ให้เลือก		faculty+department
	var m300=new Array();   
		 m300[0]=new Option("เลือก","00");
	// สาขาวิชา คณะวิศวกรรมศาสตร์
	var m301=new Array();
		 m301[0]=new Option("วิศวกรรมไฟฟ้า","01");	
		 m301[1]=new Option("วิศวกรรมระบบควบคุม","02");
		 m301[2]=new Option("วิศวกรรมเครื่องกล","03");
		 m301[3]=new Option("วิศวกรรมอิเล็กทรอนิกส์","04");
		 m301[4]=new Option("วิศวกรรมไมโครอิเล็กทรอนิกส์","12");
		 m301[5]=new Option("วิศวกรรมปิโตรเคมี","05");
		 m301[6]=new Option("วิศวกรรมเคมี","07");
		 m301[7]=new Option("วิศวกรรมการวัดคุม","06");
		 m301[8]=new Option("วิศวกรรมคอมพิวเตอร์","08");
		 m301[9]=new Option("วิศวกรรมเกษตร","09");
		 m301[10]=new Option("วิศวกรรมโทรคมนาคม","10");
		 m301[11]=new Option("วิศวกรรมสารสนเทศ","11");			 

	// สาขาวิชา คณะสถาบัตยกรรมศาสตร์
	var m302=new Array();
		 m302[0]=new Option("การวางแผนชุมชนเมืองและสภาพแวดล้อม","13");
		 m302[1]=new Option("สถาปัตยกรรมเขตร้อน","14");	
		 m302[2]=new Option("สถาปัตยกรรมภายใน","15");
		 m302[3]=new Option("ศิลปอุตสาหกรรม","16");	

	// สาขาวิชา คณะครุศาสตร์อุตสาหกรรม	
	var m303=new Array();
		 m303[0]=new Option("การบริหารอาชีวศึกษา","17");
		 m303[1]=new Option("การศึกษาวิทยาศาสตร์","19");
		 m303[2]=new Option("เทคโนโลยีการศึกษาทางการอาชีวะและเทคนิคศึกษา","22");
		 m303[3]=new Option("หลักสูตรและการสอนอาชีวศึกษา","23");
		 m303[4]=new Option("สถาปัตยกรรม","18");
		 m303[5]=new Option("เทคโนโลยีผลิตภัณฑ์อุตสาหกรรม","25");
		 m303[6]=new Option("ครุศาสตร์เกษตร","20");
		 m303[7]=new Option("วิทยาการจัดการอุตสาหกรรม","21");
		 m303[8]=new Option("ภาษาศาสตร์ประยุกต์-ภาษาอังกฤษเพื่อวิทยาศาสตร์และเทคโนโลยี","26");
		 m303[9]=new Option("วิศวกรรมไฟฟ้าสื่อสาร","24");

	// สาขาวิชา คณะวิทยาศาสตร์
	var m304=new Array();
		 m304[0]=new Option("ฟิสิกส์ประยุกต์","27");
		 m304[1]=new Option("มาตรวิทยา","35");
		 m304[2]=new Option("เทคโนโลยีชีวภาพ","28");
		 m304[3]=new Option("เคมีประยุกต์","29");
		 m304[4]=new Option("เคมี","31");
		 m304[5]=new Option("เทคโนโลยีพอลิเมอร์","33");
		 m304[6]=new Option("ปิโครเคมีและเคมีของไฮโครคาร์บอน","34");
		 m304[7]=new Option("เคมีสิ่งแวดล้อม","36");
		 m304[8]=new Option("คณิตศาสตร์ประยุกต์","30");
		 m304[9]=new Option("วิทยาการคอมพิวเตอร์","37");
		 m304[10]=new Option("สถิติประยุกต์","32");

		  
	// สาขาวิชา คณะเทคโนโลยีการเกษตร
	var m305=new Array();
		 m305[0]=new Option("เทคโนโลยีชีวภาพทางโรคพืช","38");
		 m305[1]=new Option("เทคโนโลยีการจัดการศัตรูพ์ช","42");
  		 m305[2]=new Option("กีฏวิทยาและสิ่งแวดล้อม","44");
		 m305[3]=new Option("สัตวศาสตร์","39");
		 m305[4]=new Option("พืชไร่","40");
		 m305[5]=new Option("พืชสวน","41");
		 m305[6]=new Option("ปฐพีวิทยา","43");
		 m305[7]=new Option("บริหารธุรกิจ","45");
		 m305[8]=new Option("การจัดการธุรกิจเกษตรและอุตสาหกรรมอาหาร","46");
	
	// สาขาวิชา โครงการคณะอุสาหกรรมเกษตร
	var m306=new Array();
		 m306[0]=new Option("วิทยาศาสตร์การอาหาร","47");
		 m306[1]=new Option("สุขาภิบาลอาหาร","48");
	
	// สาขาวิชา คณะเทคโนโลยีสานสนเทศ
	var m307=new Array();
		  m307[0]=new Option("เทคโนโลยีสารสนเทศ","49");

	// end สาขาวิชา เอาไว้เปลี่ยนตรง สอนในหลักสูตร 3----------------------------------------------

	//------------- ชื่อหลักสูตร  1 -------------------------------------------------------------
	var c10000=new Array();
		  c10000[0]=new Option("เลือก","00");

	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาไฟฟ้า
	var c10101=new Array();
		  c10101[0]=new Option("วิศวกรรมศาสตรดุษฎีบัณฑิต","1");
		  c10101[1]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","2");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาระบบควบคุม
	var c10102=new Array();
		  c10102[0]=new Option("วิศวกรรมศาสตรดุษฎีบัณฑิต","3");
		  c10102[1]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","4");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาเครื่องกล
	var c10103=new Array();
		  c10103[0]=new Option("วิศวกรรมศาสตรดุษฎีบัณฑิต","5");
		  c10103[1]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","6");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาอิเล็กทรอนนิกส์
	var c10104=new Array();
		  c10104[0]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","7");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ ปิโตรเคมี
	var c10105=new Array();
		  c10105[0]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","9");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาการวัดคุม
	var c10106=new Array();
		  c10106[0]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","11");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาเคมี
	var c10107=new Array();
		  c10107[0]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","10");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาคอมพิวเตอร์
	var c10108=new Array();
		  c10108[0]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","12");
		// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาเกษตร
	var c10109=new Array();
		  c10109[0]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","13");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาโทรคมนาคม
	var c10110=new Array();
		  c10110[0]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","14");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาสารสนเทศ
	var c10111=new Array();
		  c10111[0]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","15");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาไมโครอิเล็กทรอนิกส์
	var c10112=new Array();
		  c10112[0]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","8");

	// ----- หลักสูตร คณะสถาปัตยกรรมศาสตร์ สาขาการวางแผนชุมชนเมืองและสภาพแวดล้อม
	var c10213=new Array();
		  c10213[0]=new Option("การวางแผนภาคและเมืองดุษฎีบัณฑิต","16");
		  c10213[1]=new Option("การวางแผนภาคและเมืองมหาบัณฑิต","17");
	// ----- หลักสูตร คณะสถาปัตยกรรมศาสตร์ สาขาสถาปัตยกรรมเขตร้อน
	var c10214=new Array();
		  c10214[0]=new Option("สถาปัตยกรรมศาสตรมหาบัณฑิต","18");
	// ----- หลักสูตร คณะสถาปัตยกรรมศาสตร์ สาขาสถาปัตยกรรมภายใน
	var c10215=new Array();
		  c10215[0]=new Option("สถาปัตยกรรมศาสตรมหาบัณฑิต","19");
	// ----- หลักสูตร คณะสถาปัตยกรรมศาสตร์ สาขาศิลปอุตสาหกรรม
	var c10216=new Array();
		  c10216[0]=new Option("สถาปัตยกรรมศาสตรมหาบัณฑิต","20");

	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาการบริหารอาชีวศึกษา
	var c10317=new Array();
		  c10317[0]=new Option("ครุศาสตร์อุตสาหกรรมดุษฎีบัณฑิต","21");
		  c10317[1]=new Option("ครุศาสตร์อุตสาหกรรมมหาบัณฑิต","22");
	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาสถาปัตยกรรม
	var c10318=new Array();
		  c10318[0]=new Option("ครุศาสตร์อุตสาหกรรมมหาบัณฑิต","23");
	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาการศึกษาวิทยาศาสตร์
	var c10319=new Array();
		  c10319[0]=new Option("วิทยาศาสตรมหาบัณฑิต","25");
	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาครุศาสตร์เกษตร
	var c10320=new Array();
		  c10320[0]=new Option("วิทยาศาสตรมหาบัณฑิต","29");
	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาวิทยาการจัดการอุตสาหกรรม
	var c10321=new Array();
		  c10321[0]=new Option("วิทยาศาสตรมหาบัณฑิต","30");
	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาเทคโนโลยีการศึกษาทางการอาชีวะและเทคนิคศึกษา
	var c10322=new Array();
		  c10322[0]=new Option("ครุศาสตร์อุตสาหกรรมมหาบัณฑิต","27");
	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาหลักสูตรและการสอนอาชีวศึกษา
	var c10323=new Array();
		  c10323[0]=new Option("ครุศาสตร์อุตสาหกรรมมหาบัณฑิต","28");
	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาวิศวกรรมไฟฟ้าสื่อสาร
	var c10324=new Array();
		  c10324[0]=new Option("ครุศาสตร์อุตสาหกรรมมหาบัณฑิต","32");
	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาเทคโนโลยีผลิคภัณฑ์อุตสาหกรรม
	var c10325=new Array();
		  c10325[0]=new Option("ครุศาสตร์อุตสาหกรรมมหาบัณฑิต","24");
	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาภาษาศาสตร์ประยุกต์-ภาษาอังกฤษเพื่อวิทยาศาสตร์และเทคโนโลยี
	var c10326=new Array();
		  c10326[0]=new Option("ศิลปศาสตรมหาบัณฑิต","31");

	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาฟิสิกส์ประยุกต์
	var c10427=new Array();
		  c10427[0]=new Option("ปรัชญาดุษฎีบัณฑิต","33");
		  c10427[1]=new Option("วิทยาศาสตรมหาบัณฑิต","34");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาเทคโนโลยีชีวภาพ
	var c10428=new Array();
		  c10428[0]=new Option("วิทยาศาสตรมหาบัณฑิต","36");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาเคมีประยุกต์
	var c10429=new Array();
		  c10429[0]=new Option("วิทยาศาสตรมหาบัณฑิต","37");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาคณิตศาสตร์ประยุกต์
	var c10430=new Array();
		  c10430[0]=new Option("วิทยาศาสตรมหาบัณฑิต","42");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาเคมี
	var c10431=new Array();
		  c10431[0]=new Option("วิทยาศาสตรมหาบัณฑิต","38");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาสถิติประยุกต์
	var c10432=new Array();
		  c10432[0]=new Option("วิทยาศาสตรมหาบัณฑิต","44");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาเทคโนโลยีพอลิเมอร์
	var c10433=new Array();
		  c10433[0]=new Option("วิทยาศาสตรมหาบัณฑิต","39");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาปิโครเคมีและเคมีของไฮโดรคาร์บอน
	var c10434=new Array();
		  c10434[0]=new Option("วิทยาศาสตรมหาบัณฑิต","40");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขามาตรวิทยา
	var c10435=new Array();
		  c10435[0]=new Option("วิทยาศาสตรมหาบัณฑิต","35");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาเคมีสิ่งแวดล้อม
	var c10436=new Array();
		  c10436[0]=new Option("วิทยาศาสตรมหาบัณฑิต","41");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาวิทยาการคอมพิวเตอร์
	var c10437=new Array();
		  c10437[0]=new Option("วิทยาศาสตรมหาบัณฑิต","43");

	// ----- หลักสูตร คณะเทคโนโลยีเกษตร สาขาเทคโนโลยีชีวภาพทางโรคพืช
	var c10538=new Array();
		  c10538[0]=new Option("ปรัชญาดุษฎีบัณฑิต","45");
	// ----- หลักสูตร คณะเทคโนโลยีเกษตร สาขาสัตวศาสตร์
	var c10539=new Array();
		  c10539[0]=new Option("วิทยาศาสตรมหาบัณฑิต","48");
	// ----- หลักสูตร คณะเทคโนโลยีเกษตร สาขาพืชไร่
	var c10540=new Array();
		  c10540[0]=new Option("วิทยาศาสตรมหาบัณฑิต","49");
	// ----- หลักสูตร คณะเทคโนโลยีเกษตร สาขาพืชสวน
	var c10541=new Array();
		  c10541[0]=new Option("วิทยาศาสตรมหาบัณฑิต","50");
	// ----- หลักสูตร คณะเทคโนโลยีเกษตร สาขาเทคโนโลยีการจัดการศัตรูพืช
	var c10542=new Array();
		  c10542[0]=new Option("วิทยาศาสตรมหาบัณฑิต","46");
	// ----- หลักสูตร คณะเทคโนโลยีเกษตร สาขาปฐพีวิทยา
	var c10543=new Array();
		  c10543[0]=new Option("วิทยาศาสตรมหาบัณฑิต","51");
	// ----- หลักสูตร คณะเทคโนโลยีเกษตร สาขากีฏวิทยาและสิ่งแวดล้อม
	var c10544=new Array();
		  c10544[0]=new Option("วิทยาศาสตรมหาบัณฑิต","47");
	// ----- หลักสูตร คณะเทคโนโลยีเกษตร บริหารธุรกิจเกษตร
	var c10545=new Array();
		  c10545[0]=new Option("บริหารธุรกิจมหาบัณฑิต","52");
	// ----- หลักสูตร คณะเทคโนโลยีเกษตร สาขาการจัดการธุรกิจเกษตรและอุตสาหกรรมอาหาร
	var c10546=new Array();
		  c10546[0]=new Option("บริหารธุรกิจมหาบัณฑิต","53");

	// ----- หลักสูตร โครงการคณะอุตสาหกรรมเกษตร สาขาวิทยาศาสตร์การอาหาร
	var c10647=new Array();
		  c10647[0]=new Option("วิทยาศาสตรมหาบัณฑิต","54");
	// ----- หลักสูตร โครงการคณะอุตสาหกรรมเกษตร สาขาสุขาภิบาลอาหาร
	var c10648=new Array();
		  c10648[0]=new Option("วิทยาศาสตรมหาบัณฑิต","55");

	// ----- หลักสูตร คณะเทคโนโลยีสารสนเทศ
	var c10749=new Array();
		  c10749[0]=new Option("วิทยาศาสตรมหาบัณฑิต","56");
	// -- end ชื่อหลักสูตร 1 ----------------------------------------------------------------------

	//------------- ชื่อหลักสูตร 2 -------------------------------------------------------------
	var c20000=new Array();
		  c20000[0]=new Option("เลือก","00");

	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาไฟฟ้า
	var c20101=new Array();
		  c20101[0]=new Option("วิศวกรรมศาสตรดุษฎีบัณฑิต","1");
		  c20101[1]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","2");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาระบบควบคุม
	var c20102=new Array();
		  c20102[0]=new Option("วิศวกรรมศาสตรดุษฎีบัณฑิต","3");
		  c20102[1]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","4");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาเครื่องกล
	var c20103=new Array();
		  c20103[0]=new Option("วิศวกรรมศาสตรดุษฎีบัณฑิต","5");
		  c20103[1]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","6");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาอิเล็กทรอนนิกส์
	var c20104=new Array();
		  c20104[0]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","7");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ ปิโตรเคมี
	var c20105=new Array();
		  c20105[0]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","9");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาการวัดคุม
	var c20106=new Array();
		  c20106[0]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","11");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาเคมี
	var c20107=new Array();
		  c20107[0]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","10");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาคอมพิวเตอร์
	var c20108=new Array();
		  c20108[0]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","12");
		// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาเกษตร
	var c20109=new Array();
		  c20109[0]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","13");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาโทรคมนาคม
	var c20110=new Array();
		  c20110[0]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","14");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาสารสนเทศ
	var c20111=new Array();
		  c20111[0]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","15");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาไมโครอิเล็กทรอนิกส์
	var c20112=new Array();
		  c20112[0]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","8");

	// ----- หลักสูตร คณะสถาปัตยกรรมศาสตร์ สาขาการวางแผนชุมชนเมืองและสภาพแวดล้อม
	var c20213=new Array();
		  c20213[0]=new Option("การวางแผนภาคและเมืองดุษฎีบัณฑิต","16");
		  c20213[1]=new Option("การวางแผนภาคและเมืองมหาบัณฑิต","17");
	// ----- หลักสูตร คณะสถาปัตยกรรมศาสตร์ สาขาสถาปัตยกรรมเขตร้อน
	var c20214=new Array();
		  c20214[0]=new Option("สถาปัตยกรรมศาสตรมหาบัณฑิต","18");
	// ----- หลักสูตร คณะสถาปัตยกรรมศาสตร์ สาขาสถาปัตยกรรมภายใน
	var c20215=new Array();
		  c20215[0]=new Option("สถาปัตยกรรมศาสตรมหาบัณฑิต","19");
	// ----- หลักสูตร คณะสถาปัตยกรรมศาสตร์ สาขาศิลปอุตสาหกรรม
	var c20216=new Array();
		  c20216[0]=new Option("สถาปัตยกรรมศาสตรมหาบัณฑิต","20");

	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาการบริหารอาชีวศึกษา
	var c20317=new Array();
		  c20317[0]=new Option("ครุศาสตร์อุตสาหกรรมดุษฎีบัณฑิต","21");
		  c20317[1]=new Option("ครุศาสตร์อุตสาหกรรมมหาบัณฑิต","22");
	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาสถาปัตยกรรม
	var c20318=new Array();
		  c20318[0]=new Option("ครุศาสตร์อุตสาหกรรมมหาบัณฑิต","23");
	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาการศึกษาวิทยาศาสตร์
	var c20319=new Array();
		  c20319[0]=new Option("วิทยาศาสตรมหาบัณฑิต","25");
	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาครุศาสตร์เกษตร
	var c20320=new Array();
		  c20320[0]=new Option("วิทยาศาสตรมหาบัณฑิต","29");
	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาวิทยาการจัดการอุตสาหกรรม
	var c20321=new Array();
		  c20321[0]=new Option("วิทยาศาสตรมหาบัณฑิต","30");
	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาเทคโนโลยีการศึกษาทางการอาชีวะและเทคนิคศึกษา
	var c20322=new Array();
		  c20322[0]=new Option("ครุศาสตร์อุตสาหกรรมมหาบัณฑิต","27");
	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาหลักสูตรและการสอนอาชีวศึกษา
	var c20323=new Array();
		  c20323[0]=new Option("ครุศาสตร์อุตสาหกรรมมหาบัณฑิต","28");
	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาวิศวกรรมไฟฟ้าสื่อสาร
	var c20324=new Array();
		  c20324[0]=new Option("ครุศาสตร์อุตสาหกรรมมหาบัณฑิต","32");
	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาเทคโนโลยีผลิคภัณฑ์อุตสาหกรรม
	var c20325=new Array();
		  c20325[0]=new Option("ครุศาสตร์อุตสาหกรรมมหาบัณฑิต","24");
	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาภาษาศาสตร์ประยุกต์-ภาษาอังกฤษเพื่อวิทยาศาสตร์และเทคโนโลยี
	var c20326=new Array();
		  c20326[0]=new Option("ศิลปศาสตรมหาบัณฑิต","31");

	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาฟิสิกส์ประยุกต์
	var c20427=new Array();
		  c20427[0]=new Option("ปรัชญาดุษฎีบัณฑิต","33");
		  c20427[1]=new Option("วิทยาศาสตรมหาบัณฑิต","34");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาเทคโนโลยีชีวภาพ
	var c20428=new Array();
		  c20428[0]=new Option("วิทยาศาสตรมหาบัณฑิต","36");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาเคมีประยุกต์
	var c20429=new Array();
		  c20429[0]=new Option("วิทยาศาสตรมหาบัณฑิต","37");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาคณิตศาสตร์ประยุกต์
	var c20430=new Array();
		  c20430[0]=new Option("วิทยาศาสตรมหาบัณฑิต","42");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาเคมี
	var c20431=new Array();
		  c20431[0]=new Option("วิทยาศาสตรมหาบัณฑิต","38");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาสถิติประยุกต์
	var c20432=new Array();
		  c20432[0]=new Option("วิทยาศาสตรมหาบัณฑิต","44");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาเทคโนโลยีพอลิเมอร์
	var c20433=new Array();
		  c20433[0]=new Option("วิทยาศาสตรมหาบัณฑิต","39");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาปิโครเคมีและเคมีของไฮโดรคาร์บอน
	var c20434=new Array();
		  c20434[0]=new Option("วิทยาศาสตรมหาบัณฑิต","40");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขามาตรวิทยา
	var c20435=new Array();
		  c20435[0]=new Option("วิทยาศาสตรมหาบัณฑิต","35");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาเคมีสิ่งแวดล้อม
	var c20436=new Array();
		  c20436[0]=new Option("วิทยาศาสตรมหาบัณฑิต","41");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาวิทยาการคอมพิวเตอร์
	var c20437=new Array();
		  c20437[0]=new Option("วิทยาศาสตรมหาบัณฑิต","43");

	// ----- หลักสูตร คณะเทคโนโลยีเกษตร สาขาเทคโนโลยีชีวภาพทางโรคพืช
	var c20538=new Array();
		  c20538[0]=new Option("ปรัชญาดุษฎีบัณฑิต","45");
	// ----- หลักสูตร คณะเทคโนโลยีเกษตร สาขาสัตวศาสตร์
	var c20539=new Array();
		  c20539[0]=new Option("วิทยาศาสตรมหาบัณฑิต","48");
	// ----- หลักสูตร คณะเทคโนโลยีเกษตร สาขาพืชไร่
	var c20540=new Array();
		  c20540[0]=new Option("วิทยาศาสตรมหาบัณฑิต","49");
	// ----- หลักสูตร คณะเทคโนโลยีเกษตร สาขาพืชสวน
	var c20541=new Array();
		  c20541[0]=new Option("วิทยาศาสตรมหาบัณฑิต","50");
	// ----- หลักสูตร คณะเทคโนโลยีเกษตร สาขาเทคโนโลยีการจัดการศัตรูพืช
	var c20542=new Array();
		  c20542[0]=new Option("วิทยาศาสตรมหาบัณฑิต","46");
	// ----- หลักสูตร คณะเทคโนโลยีเกษตร สาขาปฐพีวิทยา
	var c20543=new Array();
		  c20543[0]=new Option("วิทยาศาสตรมหาบัณฑิต","51");
	// ----- หลักสูตร คณะเทคโนโลยีเกษตร สาขากีฏวิทยาและสิ่งแวดล้อม
	var c20544=new Array();
		  c20544[0]=new Option("วิทยาศาสตรมหาบัณฑิต","47");
	// ----- หลักสูตร คณะเทคโนโลยีเกษตร บริหารธุรกิจเกษตร
	var c20545=new Array();
		  c20545[0]=new Option("บริหารธุรกิจมหาบัณฑิต","52");
	// ----- หลักสูตร คณะเทคโนโลยีเกษตร สาขาการจัดการธุรกิจเกษตรและอุตสาหกรรมอาหาร
	var c20546=new Array();
		  c20546[0]=new Option("บริหารธุรกิจมหาบัณฑิต","53");

	// ----- หลักสูตร โครงการคณะอุตสาหกรรมเกษตร สาขาวิทยาศาสตร์การอาหาร
	var c20647=new Array();
		  c20647[0]=new Option("วิทยาศาสตรมหาบัณฑิต","54");
	// ----- หลักสูตร โครงการคณะอุตสาหกรรมเกษตร สาขาสุขาภิบาลอาหาร
	var c20648=new Array();
		  c20648[0]=new Option("วิทยาศาสตรมหาบัณฑิต","55");

	// ----- หลักสูตร คณะเทคโนโลยีสารสนเทศ
	var c20749=new Array();
		  c20749[0]=new Option("วิทยาศาสตรมหาบัณฑิต","56");
	// -- end ชื่อหลักสูตร 2 ----------------------------------------------------------------------

//------------- ชื่อหลักสูตร  3 -------------------------------------------------------------
	var c30000=new Array();
		  c30000[0]=new Option("เลือก","00");

	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาไฟฟ้า
	var c30101=new Array();
		  c30101[0]=new Option("วิศวกรรมศาสตรดุษฎีบัณฑิต","1");
		  c30101[1]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","2");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาระบบควบคุม
	var c30102=new Array();
		  c30102[0]=new Option("วิศวกรรมศาสตรดุษฎีบัณฑิต","3");
		  c30102[1]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","4");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาเครื่องกล
	var c30103=new Array();
		  c30103[0]=new Option("วิศวกรรมศาสตรดุษฎีบัณฑิต","5");
		  c30103[1]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","6");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาอิเล็กทรอนนิกส์
	var c30104=new Array();
		  c30104[0]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","7");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ ปิโตรเคมี
	var c30105=new Array();
		  c30105[0]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","9");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาการวัดคุม
	var c30106=new Array();
		  c30106[0]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","11");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาเคมี
	var c30107=new Array();
		  c30107[0]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","10");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาคอมพิวเตอร์
	var c30108=new Array();
		  c30108[0]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","12");
		// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาเกษตร
	var c30109=new Array();
		  c30109[0]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","13");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาโทรคมนาคม
	var c30110=new Array();
		  c30110[0]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","14");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาสารสนเทศ
	var c30111=new Array();
		  c30111[0]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","15");
	// ----- หลักสูตรคณะวิศวกรรมศาสตร์ สาขาไมโครอิเล็กทรอนิกส์
	var c30112=new Array();
		  c30112[0]=new Option("วิศวกรรมศาสตรมาหาบัณฑิต","8");

	// ----- หลักสูตร คณะสถาปัตยกรรมศาสตร์ สาขาการวางแผนชุมชนเมืองและสภาพแวดล้อม
	var c30213=new Array();
		  c30213[0]=new Option("การวางแผนภาคและเมืองดุษฎีบัณฑิต","16");
		  c30213[1]=new Option("การวางแผนภาคและเมืองมหาบัณฑิต","17");
	// ----- หลักสูตร คณะสถาปัตยกรรมศาสตร์ สาขาสถาปัตยกรรมเขตร้อน
	var c30214=new Array();
		  c30214[0]=new Option("สถาปัตยกรรมศาสตรมหาบัณฑิต","18");
	// ----- หลักสูตร คณะสถาปัตยกรรมศาสตร์ สาขาสถาปัตยกรรมภายใน
	var c30215=new Array();
		  c30215[0]=new Option("สถาปัตยกรรมศาสตรมหาบัณฑิต","19");
	// ----- หลักสูตร คณะสถาปัตยกรรมศาสตร์ สาขาศิลปอุตสาหกรรม
	var c30216=new Array();
		  c30216[0]=new Option("สถาปัตยกรรมศาสตรมหาบัณฑิต","20");

	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาการบริหารอาชีวศึกษา
	var c30317=new Array();
		  c30317[0]=new Option("ครุศาสตร์อุตสาหกรรมดุษฎีบัณฑิต","21");
		  c30317[1]=new Option("ครุศาสตร์อุตสาหกรรมมหาบัณฑิต","22");
	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาสถาปัตยกรรม
	var c30318=new Array();
		  c30318[0]=new Option("ครุศาสตร์อุตสาหกรรมมหาบัณฑิต","23");
	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาการศึกษาวิทยาศาสตร์
	var c30319=new Array();
		  c30319[0]=new Option("วิทยาศาสตรมหาบัณฑิต","25");
	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาครุศาสตร์เกษตร
	var c30320=new Array();
		  c30320[0]=new Option("วิทยาศาสตรมหาบัณฑิต","29");
	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาวิทยาการจัดการอุตสาหกรรม
	var c30321=new Array();
		  c30321[0]=new Option("วิทยาศาสตรมหาบัณฑิต","30");
	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาเทคโนโลยีการศึกษาทางการอาชีวะและเทคนิคศึกษา
	var c30322=new Array();
		  c30322[0]=new Option("ครุศาสตร์อุตสาหกรรมมหาบัณฑิต","27");
	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาหลักสูตรและการสอนอาชีวศึกษา
	var c30323=new Array();
		  c30323[0]=new Option("ครุศาสตร์อุตสาหกรรมมหาบัณฑิต","28");
	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาวิศวกรรมไฟฟ้าสื่อสาร
	var c30324=new Array();
		  c30324[0]=new Option("ครุศาสตร์อุตสาหกรรมมหาบัณฑิต","32");
	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาเทคโนโลยีผลิคภัณฑ์อุตสาหกรรม
	var c30325=new Array();
		  c30325[0]=new Option("ครุศาสตร์อุตสาหกรรมมหาบัณฑิต","24");
	// ----- หลักสูตร คณะครุศาสตร์อุตสาหกรรม สาขาภาษาศาสตร์ประยุกต์-ภาษาอังกฤษเพื่อวิทยาศาสตร์และเทคโนโลยี
	var c30326=new Array();
		  c30326[0]=new Option("ศิลปศาสตรมหาบัณฑิต","31");

	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาฟิสิกส์ประยุกต์
	var c30427=new Array();
		  c30427[0]=new Option("ปรัชญาดุษฎีบัณฑิต","33");
		  c30427[1]=new Option("วิทยาศาสตรมหาบัณฑิต","34");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาเทคโนโลยีชีวภาพ
	var c30428=new Array();
		  c30428[0]=new Option("วิทยาศาสตรมหาบัณฑิต","36");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาเคมีประยุกต์
	var c30429=new Array();
		  c30429[0]=new Option("วิทยาศาสตรมหาบัณฑิต","37");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาคณิตศาสตร์ประยุกต์
	var c30430=new Array();
		  c30430[0]=new Option("วิทยาศาสตรมหาบัณฑิต","42");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาเคมี
	var c30431=new Array();
		  c30431[0]=new Option("วิทยาศาสตรมหาบัณฑิต","38");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาสถิติประยุกต์
	var c30432=new Array();
		  c30432[0]=new Option("วิทยาศาสตรมหาบัณฑิต","44");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาเทคโนโลยีพอลิเมอร์
	var c30433=new Array();
		  c30433[0]=new Option("วิทยาศาสตรมหาบัณฑิต","39");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาปิโครเคมีและเคมีของไฮโดรคาร์บอน
	var c30434=new Array();
		  c30434[0]=new Option("วิทยาศาสตรมหาบัณฑิต","40");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขามาตรวิทยา
	var c30435=new Array();
		  c30435[0]=new Option("วิทยาศาสตรมหาบัณฑิต","35");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาเคมีสิ่งแวดล้อม
	var c30436=new Array();
		  c30436[0]=new Option("วิทยาศาสตรมหาบัณฑิต","41");
	// ----- หลักสูตร คณะวิทยาศาสตร์ สาขาวิทยาการคอมพิวเตอร์
	var c30437=new Array();
		  c30437[0]=new Option("วิทยาศาสตรมหาบัณฑิต","43");

	// ----- หลักสูตร คณะเทคโนโลยีเกษตร สาขาเทคโนโลยีชีวภาพทางโรคพืช
	var c30538=new Array();
		  c30538[0]=new Option("ปรัชญาดุษฎีบัณฑิต","45");
	// ----- หลักสูตร คณะเทคโนโลยีเกษตร สาขาสัตวศาสตร์
	var c30539=new Array();
		  c30539[0]=new Option("วิทยาศาสตรมหาบัณฑิต","48");
	// ----- หลักสูตร คณะเทคโนโลยีเกษตร สาขาพืชไร่
	var c30540=new Array();
		  c30540[0]=new Option("วิทยาศาสตรมหาบัณฑิต","49");
	// ----- หลักสูตร คณะเทคโนโลยีเกษตร สาขาพืชสวน
	var c30541=new Array();
		  c30541[0]=new Option("วิทยาศาสตรมหาบัณฑิต","50");
	// ----- หลักสูตร คณะเทคโนโลยีเกษตร สาขาเทคโนโลยีการจัดการศัตรูพืช
	var c30542=new Array();
		  c30542[0]=new Option("วิทยาศาสตรมหาบัณฑิต","46");
	// ----- หลักสูตร คณะเทคโนโลยีเกษตร สาขาปฐพีวิทยา
	var c30543=new Array();
		  c30543[0]=new Option("วิทยาศาสตรมหาบัณฑิต","51");
	// ----- หลักสูตร คณะเทคโนโลยีเกษตร สาขากีฏวิทยาและสิ่งแวดล้อม
	var c30544=new Array();
		  c30544[0]=new Option("วิทยาศาสตรมหาบัณฑิต","47");
	// ----- หลักสูตร คณะเทคโนโลยีเกษตร บริหารธุรกิจเกษตร
	var c30545=new Array();
		  c30545[0]=new Option("บริหารธุรกิจมหาบัณฑิต","52");
	// ----- หลักสูตร คณะเทคโนโลยีเกษตร สาขาการจัดการธุรกิจเกษตรและอุตสาหกรรมอาหาร
	var c30546=new Array();
		  c30546[0]=new Option("บริหารธุรกิจมหาบัณฑิต","53");

	// ----- หลักสูตร โครงการคณะอุตสาหกรรมเกษตร สาขาวิทยาศาสตร์การอาหาร
	var c30647=new Array();
		  c30647[0]=new Option("วิทยาศาสตรมหาบัณฑิต","54");
	// ----- หลักสูตร โครงการคณะอุตสาหกรรมเกษตร สาขาสุขาภิบาลอาหาร
	var c30648=new Array();
		  c30648[0]=new Option("วิทยาศาสตรมหาบัณฑิต","55");

	// ----- หลักสูตร คณะเทคโนโลยีสารสนเทศ
	var c30749=new Array();
		  c30749[0]=new Option("วิทยาศาสตรมหาบัณฑิต","56");
	// -- end ชื่อหลักสูตร 3 ----------------------------------------------------------------------

	department=null;
	 facul=null;
	 facul_en=null;
	 major=null;
	
	// init -------------------------------------------------------------------------------------
	 function init(fac,dpt,maj,teachfac1,teachmaj1,teachfac2,teachmaj2){

		tmp=eval("d"+fac.value+"th");
		dpt.length=0;
		for(i=0; i<tmp.length; i++)dpt.options[i]=tmp[i];
			dpt.options[0].selected=true;
		
		tmp=eval("m"+fac.value+dpt.value);
		maj.length=0;
		for(i=0; i<tmp.length; i++)maj.options[i]=tmp[i];
			maj.options[0].selected=true;
				///---------------------------------------------------

		/// ****** function เปลี่ยนชื่อ สาขาวิชา	ให้ faculty มาอย่างเดียว ( สอนในหลักสูตร )
	/*	
			tmp1=eval("ma"+teachfac1.value);
			teachmaj1.length=0;
			for(i=0; i<tmp1.length; i++)teachmaj1.options[i]=tmp1[i];
				teachmaj1.options[0].selected=true;	

			tmp2=eval("m2"+teachfac2.value);
			teachmaj2.length=0;
			for(i=0; i<tmp2.length; i++)teachmaj2.options[i]=tmp2[i];
				teachmaj2.options[0].selected=true;	
	
	
		tmp=eval("c00");
			course3.length=0;
//			for(i=0; i<tmp.length; i++)course3.options[i]=tmp[i];
			for(i=0; i<c02.length; i++)course3.options[i]=c02[i];

				course3.options[0].selected=true;	
*/		
	}
	//  end init -------------------------------------------------------------------------------------

	// ****** function เปลี่ยนชื่อ ภาควิชา	
		function departmentChange(fac,dpt,maj){
		
			tmp=eval("d"+fac.value+"th");
			dpt.length=0;
			for(i=0; i<tmp.length; i++)dpt.options[i]=tmp[i];
			dpt.options[0].selected=true;
			
			// เปลี่ยนชื่อ list สาขาวิชา																
			tmp=eval("m"+fac.value+dpt.value);
			maj.length=0;
			for(i=0; i<tmp.length; i++)maj.options[i]=tmp[i];
				maj.options[0].selected=true;			
			}

	/// ****** function เปลี่ยนชื่อ สาขาวิชา
		function majorChange(fac,dpt,maj){
			tmp=eval("m"+fac.value+dpt.value);
			maj.length=0;
			for(i=0; i<tmp.length; i++)maj.options[i]=tmp[i];
				maj.options[0].selected=true;	
		}

		/// ****** function เปลี่ยนชื่อ สาขาวิชา	ให้ faculty มาอย่างเดียว ( สอนในหลักสูตร )
		function majorChange21(fac,maj,course){
			tmp=eval("m1"+fac.value);
			maj.length=0;
			for(i=0; i<tmp.length; i++)maj.options[i]=tmp[i];
				maj.options[0].selected=true;	
			
			tmp=eval("c1"+fac.value+maj.value);
			course.length=0;
			for(i=0; i<tmp.length; i++)course.options[i]=tmp[i];
				course.options[0].selected=true;			
		}

		function majorChange22(fac,maj,course){
			tmp=eval("m2"+fac.value);
			maj.length=0;
			for(i=0; i<tmp.length; i++)maj.options[i]=tmp[i];
				maj.options[0].selected=true;	

			tmp=eval("c2"+fac.value+maj.value);
			course.length=0;
			for(i=0; i<tmp.length; i++)course.options[i]=tmp[i];
				course.options[0].selected=true;			
		}

		function majorChange23(fac,maj,course){
			tmp=eval("m3"+fac.value);
			maj.length=0;
			for(i=0; i<tmp.length; i++)maj.options[i]=tmp[i];
				maj.options[0].selected=true;	

			tmp=eval("c3"+fac.value+maj.value);
			course.length=0;
			for(i=0; i<tmp.length; i++)course.options[i]=tmp[i];
				course.options[0].selected=true;
		}
	

	/// ****** function เปลี่ยนชื่อหลักสูตร
		function courseChange1(faculty,major,course){
			tmp=eval("c1"+faculty.value+major.value);
			course.length=0;
			for(i=0; i<tmp.length; i++)course.options[i]=tmp[i];
				course.options[0].selected=true;			
		}

		function courseChange2(faculty,major,course){
			tmp=eval("c2"+faculty.value+major.value);
			course.length=0;
			for(i=0; i<tmp.length; i++)course.options[i]=tmp[i];
				course.options[0].selected=true;			
		}

		function courseChange3(faculty,major,course){
			tmp=eval("c3"+faculty.value+major.value);
			course.length=0;
			for(i=0; i<tmp.length; i++)course.options[i]=tmp[i];
				course.options[0].selected=true;			
		}
