<?php
function ThaiDate($z)
	{
		$ThDay = array ( "อาทิตย์", "จันทร์", "อังคาร", "พุธ", "พฤหัส", "ศุกร์", "เสาร์" );
		$ThMonth = array (	"มกราคม", "กุมภาพันธ์", "มีนาคม", "เมษายน", 
								"พฤษภาคม", "มิถุนายน", "กรกฎาคม", "สิงหาคม", 
								"กันยายน", "ตุลาคม", "พฤศจิกายน", "ธันวาคม" 	);

		$a = date( "w" );				// ค่าวันในสัปดาห์ (0-6)
		$b = date( "n" )-1;			// ค่าเดือน (1-12)
		$c = date( "j" );				// ค่าวันที่ (1-31)
		$d = date( "Y" )+543;	// ค่า ค.ศ. บวก 543 ทำให้เป็น พ.ศ.
		
		$c=$c+7;

		
	

	

	if($b==0){

		if  ($c >31){
			
			$b++;
			$a = $c - 31;
			$a  = $a+$z;
			
		}
		}


		


		if($b==1){

		if  ($c >28){

			$b++;
			$a = $c - 28;
				$a  = $a+$z;
			
		}
		}

if($b==2){

		if  ($c >31){

			$b++;
			$a = $c - 31;
				$a  = $a+$z;
			
		}
		}


		if($b==3){

		if  ($c >30){

			$b++;
			$a = $c - 30;
				$a  = $a+$z;
			
		}
		}

		if($b==4){

		if  ($c >31){

			$b++;
			$a = $c - 31;
				$a  = $a+$z;
			
		}
		}

if($b==5){

		if  ($c >30){

			$b++;
			$a = $c - 30;
				$a  = $a+$z;
			
		}
		}

		if($b==6){

		if  ($c >31){

			$b++;
			$a = $c - 31;
				$a  = $a+$z;
			
		}
		}

		if($b==7){

		if  ($c >31){

			$b++;
			$a = $c - 31;
				$a  = $a+$z;
			
		}
		}

if($b==8){

		if  ($c >30){

			$b++;
			$a = $c - 30;
				$a  = $a+$z;
			
		}
		}

if($b==9){

		if  ($c >31){

			$b++;
			$a = $c - 31;
				$a  = $a+$z;
			
		}
		}


		if($b==10){

		if  ($c >30){

			$b++;
			$a = $c - 30;
				$a  = $a+$z;
			
		}
		}
			if($b==11){

		if  ($c >31){

			$b=0;
			$a = $c - 31;
			$d++;
				$a  = $a+$z;
			
		}
		}

		$aa=$a;
		$bb=$b;
		$dd=$d;
		$a=0;
		$b=0;
		$d=0;
		$z=0;
	
		return "$aa  $ThMonth[$bb]  $dd";
		}


?>