<?php 
if (mysql_query("CREATE TABLE news(	"."news_ID int not null auto_increment primary key"."
																		,news_type text not null "."
																		,headline text not null "."
																		,story_text text not null "."
																		,small_pic text not null "."
																		,large_pic text not null "."
																		,news_order int "."
																		,created date not null "."
																		,modified date"."
																		,published date)"))
																		{print ("สร้างตาราง news สำเร็จ<br>");}
//ข่าวที่1
$published=date('Y-m-d h:i:s');
$news_ID =1;
$news_type ="ข่าวเทคโนโลยี";
$headline  = "โทรศัพท์ไร้สายโทรฟรีผ่านเน็ต";
$story_text = "	ลิงค์ซิส จับมือ สไค้พ เปิดตัวโทรศัพท์ไร้สาย รองรับบริการอินเทอร์เน็ตโฟน เพื่อเพิ่มความสะดวกในการใช้บริการโทรฯฟรีของสไค้พ
	
	ผู้สื่อข่าวรายงานว่า ลิงค์ซิส ส่วนธุรกิจของซิสโก้ ซิสเต็มส์ อิงค์ ผู้นำด้านการจัดหาอุปกรณ์ฮาร์ดแวร์ทางด้านเสียง ไร้สาย และเครือข่าย สำหรับผู้ใช้ทั่วไป และสำนักงานขนาดเล็กจับมือ สไค้พ บริษัทด้านการสื่อสารอินเทอร์เน็ตระดับโลก เปิดตัวโทรศัพท์ไร้สายรุ่นล่าสุดซึ่งรองรับบริการโทรศัพท์ฟรีผ่านอินเทอร์เน็ตของสไค้พ โดยไม่จำเป็นต้องนั่งอยู่หน้าเครื่องคอมพิวเตอร์ 
	
	สำหรับอินเทอร์เน็ต เทเลโฟนนี่ คิท (ซีไอที 200) เป็นผลิตภัณฑ์รุ่นแรกที่รองรับบริการของสไค้พ โดยประกอบด้วยชุดเครื่องมือเริ่มต้น ซึ่งจะให้ทางเลือกที่สะดวกสบายใน การใช้บริการโทรฯฟรีของสไค้พ ผู้ใช้สามารถใช้โทรศัพท์ได้จากทุกจุดภายในบ้านหรือสำนักงาน โดยไม่จำเป็นต้องนั่งอยู่ที่หน้าเครื่องคอมพิวเตอร์ทั้งนี้ ซีไอที 200 เริ่มวางจำหน่ายแล้วผ่านร้านค้าปลีกทั่วไปและร้านค้าออนไลน์กว่า 3,000 แห่งในอเมริกาเหนือ ลาติน อเมริกา เอเชีย-แปซิฟิก ยุโรป ตะวันออกกลาง และแอฟริกา
	
	มร.เจมส์ ไบล์ฟิลด์ รองประธานฝ่ายพัฒนาธุรกิจของสไค้พ เปิดเผยว่า สไค้พเป็นผู้บุกเบิกบริการอินเทอร์เน็ตโฟน โดยมีผู้ใช้ใหม่กว่าวันละ 170,000 คน ซึ่งเชื่อมั่นว่าความร่วมมือกับลิงค์ซิสจะช่วยเพิ่มอัตราการเติบโต เพราะผู้ใช้ทั่วโลกจะสามารถลดค่าโทรศัพท์และเพิ่มความสะดวกในการโทรฯออกและรับสายสำหรับบริการโทรฯ ฟรีของสไค้พบนซีไอที 200 ทั่วทุกจุดภายในบ้านหรือสำนักงานโดยไม่ต้องอยู่ใกล้คอมพิวเตอร์.";
$small_pic ="internet100.jpg";
$large_pic  = "internet.jpg";
$news_order=1;
mysql_query("INSERT INTO news SET "."news_ID='$news_ID' ".",news_type='$news_type' ".",headline ='$headline' ".",story_text ='$story_text' 
".",small_pic ='$small_pic' ".",large_pic ='$large_pic'".",news_order ='$news_order',created='$published',published='$published'") ;
//ข่าวที่2
$news_ID =2;
$news_type ="ข่าวเทคโนโลยี";
$headline  = "&quot;กูเกิล&quot;เขมือบโลก";
$story_text = "	กูเกิลเริ่มต้นจากการทำเสิร์ชเอ็นจิ้นเล็ก ก้าวขึ้นมาเป็นยักษ์ใหญ่ที่หลายคนเกิดความกลัวเพราะการขยายตัวไปในทิศทางต่างๆ นอกเหนือจากการเป็นเสิร์ชเอ็นจิ้นธรรมดา ไม่ว่าจะเป็นการเข้าไปเป็นผู้ให้บริการไวไฟ, บริการค้นเข้าไปถึงเนื้อในของหนังสือ หรือแผนที่จะทำการค้าผ่านอินเทอร์เน็ต ที่ผ่านมาเราได้ยินข่าวลือเกี่ยวกับ กูเกิลบ่อยๆ ว่าจะก้าวขึ้นมาท้าทายไมโครซอฟท์ ทั้งในเรื่องระบบปฏิบัติการคอมพิวเตอร์ หรือกระทั่งซอฟต์แวร์ชุดออฟฟิศ
	
	นิตยสารไวรด์ ไล่เรียงแต่ละประเด็นออกมาให้เห็นโอกาสในการรุกคืบของกูเกิลและผู้ที่อยู่ในธุรกิจเดิมซึ่งเสี่ยงต่อภัยคุกคาม เริ่มตั้งแต่อันดับแรก &quot;กูเกิลวิดีโอ&quot; อันเป็นแหล่งรวมสารพัดวิดีโอจากทั่วโลก ทุกวันนี้วิดีโอที่ค้นได้มากมายจากกู้เกิลอาจจะยังไม่เป็นโล้เป็นพายนัก แต่ถ้ากูเกิลคิดจะเอาจริงทางด้านนี้ บริษัทที่ต้องคิดหนักไล่กันไปตั้งแต่คอมแคสต์, ยาฮู, เครือข่ายสถานีโทรทัศน์ และเคเบิลทีวีทั้งหมด
	
	อันดับถัดมา โฆษณาย่อย หรือแคลสสิไฟด์ แอด. ซึ่งกูเกิลทำลงไปถึงขั้นท้องถิ่น และพัฒนาเข้ากับกูเกิลแมป ที่ให้รายละเอียดของภาพสถานที่จริงของร้านค้าเลยทีเดียว บริษัทที่ต้องเผชิญกับการแข่งขันนอกจากพวกที่ทำโฆษณาย่อยทั้งหมดเท่านั้น อีเบย์ซึ่งจัดเป็นยักษ์ใหญ่ในธุรกิจนี้เจอกับศึกหนักที่สุด เพียงแค่มีข่าวหลุดออกมาว่าจะมี &quot;กูเกิลเบส&quot; ออกมาบุกตลาดแคลสสิไฟด์โดยตรง ราคาหุ้นอีเบย์ทรุดฮวบลงจนมูลค่าหดลงไปกว่า 2,000 ล้านเหรียญ
	
	โทรคมนาคม เป็นเรื่องที่ไม่ใช่ข่าวลืออีกต่อไปเมื่อกูเกิลเสนอตัวเข้าให้บริการไวไฟในซานฟรานซิสโก ซึ่งจะทำให้คนทั้งเมืองสามารถใช้อินเทอร์เน็ตไร้สายได้ฟรี ซึ่งนั่นหมายความว่าการติดต่อสื่อสารผ่านอินเทอร์เน็ตในรูปแบบของอินสแตนต์ เมสเสจ จิ้ง และโทรศัพท์แบบวีโอไอพี อันเป็นส่วน สำคัญที่กูเกิลจะเน้น จะเข้ามาแทนที่การติดต่อสื่อสารแบบเดิม แม้ว่ากูเกิลจะยืนยันจะไม่ขยายบริการไวไฟไปนอกเหนือจากซานฟรานซิสโก แต่ไม่มีใครเชื่อ
	
	ระบบปฏิบัติการเป็นเรื่องที่พูดถึงกันมาพอสมควร แต่ไม่มีวี่แววใดๆ นอกจากการดึงตัววิศวกรคนสำคัญคนหนึ่งในทีมพัฒนาระบบปฏิบัติการของไมโครซอฟท์ไปอยู่ด้วยจนทำให้ &quot;สตีฟ บอลเมอร์&quot; หัวเสียกับเรื่องนี้มาก ถ้ากูเกิลทำจริง ก็เท่ากับท้าชนกับยักษ์ใหญ่อย่างไมโครซอฟท์ และแอปเปิล แต่ก็มีความเสี่ยงสูงมากเช่นกัน อย่างไรก็ตาม ระบบปฏิบัติการอาจจะไม่ใช่ของจำเป็นมากนักในยุคปัจจุบันที่แอปพลิเคชั่นจำนวนไม่น้อยขึ้นไปอยู่บนอินเทอร์เน็ตโดยไม่สนใจระบบปฏิบัติการ
	
	สิ่งพิมพ์ สิ่งที่ &quot;กูเกิลพรินต์&quot; กำลังทำอยู่ตอนนี้ ก็คือไปให้ถึงเป้าหมายสูงสุด คือสามารถสั่งพิมพ์ลงบนกระดาษจากทุกหน้าของหนังสือทุกเล่มในโลก คงไม่ต้องบอกว่าจะไปกระทบกับใครเข้าบ้าง 
	
	นอกจากที่กล่าวมาแล้วยังมีอย่างอื่นๆ อีกที่กูเกิลสร้างความหวาดหวั่นให้ผู้อยู่ในธุรกิจเดิม เช่น การจับมือกับ ซัน ไมโครซิสเต็ม เพื่อผลักดันโอเพ่นออฟฟิศ ผ่านกูเกิล หรือทิศทางไปสู่การพัฒนาระบบการชำระเงินผ่านอินเทอร์เน็ต เป็นต้น ";
$small_pic ="10085-tmb_02.jpg";
$large_pic  = "10085-01.jpg";
$news_order=2;
mysql_query("INSERT INTO news SET "."news_ID='$news_ID' ".",news_type='$news_type' ".",headline ='$headline' ".",story_text ='$story_text' 
".",small_pic ='$small_pic' ".",large_pic ='$large_pic'".",news_order ='$news_order',created='$published',published='$published'") ;
//ข่าวที่3
$news_ID =3;
$news_type ="ข่าวการศึกษา";
$headline  = "ชี้อุดมศึกษาไทยยิ่งอ่อนแอ เพราะการเมืองเข้าแทรก";
$story_text = "	ดร.โทมัส ปากเกอร์ ที่ปรึกษาอาวุโส สถาบันนโยบายอุดมศึกษา สหรัฐอเมริกา กล่าวตอนหนึ่งในการประชุมระดมความคิดเห็นการขับเคลื่อนยุทธศาสตร์ด้านทรัพยากรและการลงทุนเพื่อการศึกษา เมื่อเร็ว ๆ นี้ ว่า ที่ผ่านมาแนวโน้มการจัดสรรงบประมาณด้านการศึกษาของสหรัฐอเมริกาลดลงเหลือ 64% ของรายได้ของรัฐ จากที่เคยสนับสนุนอยู่ 74% เนื่องจากค่าใช้จ่ายการศึกษาที่เพิ่มขึ้น และประชาชนต้องการเรียนสูงขึ้น ทำให้รัฐบาลต้องพยายามเปิดโอกาสให้ภาคเอกชนเข้ามาช่วยแบ่งเบาภาระในการจัดการศึกษามากขึ้น 
	
	จากเดิมที่เอกชนช่วยจัดการศึกษาอยู่ 6% ปัจจุบันก็เพิ่มเป็น 18% ขณะเดียวกันก็ให้ผู้ปกครองและผู้เรียนมีส่วนร่วมในการรับภาระค่าเรียนมากขึ้น โดยเฉพาะระดับอุดมศึกษา เนื่องจากการวิจัยพบว่าผู้จบระดับอุดมศึกษาจะมีงานดี รายได้ดี ซึ่งเป็นผู้ที่ได้รับประโยชน์จากการศึกษาโดยตรง ดร.โทมัส กล่าวต่อไปว่า มหาวิทยาลัยในสหรัฐอเมริกาให้ความสำคัญกับการพัฒนาบุคลากรตั้งแต่ระดับผู้บริหาร อาจารย์และบุคลากรในมหาวิทยาลัยอย่างสม่ำเสมอ 
	
	โดยมักจะพบปัญหาว่าผู้บริหารคิดว่าตัวเองเก่งแล้วไม่จำเป็นต้องพัฒนาแต่มหาวิทยาลัยก็ไม่ปล่อยจะจัดอบรมให้แก่บุคลากรทุกคนอย่างต่อเนื่อง เพราะเห็นความสำคัญของการพัฒนามหาวิทยาลัยอย่างยั่งยืน รวมทั้งยังสนับสนุนให้อาจารย์ทำวิจัย โดยให้ภาคอุตสาหกรรมเป็นผู้กำหนดหัวข้องานวิจัยและสนับสนุนงบประมาณ เนื่องจากเป็นผู้ได้รับประโยชน์ร่วมด้วย คือ มหาวิทยาลัยได้พัฒนาการเรียนการสอน ส่วนภาคอุตสาหกรรมก็นำผลงานวิจัยไปพัฒนาสินค้าและทำให้สามารถแข่งขันกับต่างประเทศได้ด้วย 
	
	ด้าน นายกษิต ภิรมย์ อดีตเอกอัครราชทูตไทยประจำกรุงวอชิงตันดี.ซี. กล่าวว่า มหาวิทยาลัยในสหรัฐอเมริกาให้ความสำคัญกับผู้บริหารอย่างมาก คือ ผู้บริหารมหาวิทยาลัยต้องมีความรู้ ความสามารถ และเป็นมืออาชีพ ขณะที่มหาวิทยาลัยไทยจะมีการเมืองเข้ามาแทรกแซงในการคัดเลือกผู้บริหารมหา วิทยาลัยตั้งแต่อธิการบดีลงมา คณบดี หัวหน้าภาค จึงทำให้ไม่ได้คนที่เก่งที่มีความรู้ ความสามารถ และเป็นมืออาชีพ มาเป็นผู้บริหารมหาวิทยาลัยเป็นผลให้การอุดมศึกษาไทยอ่อนแอ 
	
	รวมทั้งผู้บริหารก็ไม่ได้รับการพัฒนาเท่าที่ควร อาจารย์ก็ไม่ค่อยได้ทำงานวิจัยเพื่อพัฒนาตัวเองหรือพัฒนาการสอน จึงเห็นว่าขณะที่โลกเปลี่ยนแปลงอยู่ตลอดเวลามหาวิทยาลัยไทยก็ต้องให้ความสำคัญกับการพัฒนาผู้นำ และเร่งทำวิจัยมากขึ้น เพื่อที่จะได้แข่งขันกับประเทศต่าง ๆ ได้";
$small_pic ="10072-tmb_kanmurng100.jpg";
$large_pic  = "10072-kanmurng450.jpg";
$news_order=3;
mysql_query("INSERT INTO news SET "."news_ID='$news_ID' ".",news_type='$news_type' ".",headline ='$headline' ".",story_text ='$story_text' 
".",small_pic ='$small_pic' ".",large_pic ='$large_pic'".",news_order ='$news_order',created='$published',published='$published'") ;
//ข่าวที่4
$news_ID =4;
$news_type ="ข่าวเทคโนโลยี";
$headline  = "แฮคเกอร์ถล่มระบบปลอดภัยครึ่งปี 237 ล้าน ครั้ง";
$story_text = "	ผู้เชี่ยวชาญชี้แฮคเกอร์มุ่งเป้าโจมตี 3 กลุ่มธุรกิจหลัก ราชการ-อุตสาหกรรมผลิต-การเงิน สถิติการโจมตีทั่วโลกครึ่งปีแรกกว่า 237 ล้านครั้ง ด้านไอบีเอ็มสบช่องเตรียมนำ &quot;ซอฟต์แวร์ สมาร์ท เซอร์วิแลนซ์&quot; ที่ทำหน้าที่วิเคราะห์และแจ้งเตือนถึงความผิดปกติ เสนอแก่องค์กรที่ให้ความสำคัญต่อการป้องกันก่อการร้ายส่วนเนคเทค กำหนดมาตรฐานขั้นต่ำความปลอดภัยสถาบันการเงิน เตรียมเสนอแบงก์ชาติ 
	
	นายชุติเดช ปริญฐิติภา รองกรรมการผู้จัดการ ธุรกิจบริการ บริษัท ไอบีเอ็ม ประเทศไทย จำกัด กล่าวถึงผลการวิจัยดัชนีวัดระดับความปลอดภัยของธุรกิจทั่วโลก โดยโกลบอล ซิเคียวริตี้ อินทิลิเจนซ์ ของไอบีเอ็มและพันธมิตรว่า ครึ่งปีแรกของปีนี้ มีการโจมตีระบบความปลอดภัยข้อมูลทั่วโลกกว่า 237 ล้านครั้ง 
	
	โดย 3 อันดับแรกที่โดนโจมตีมากที่สุด ได้แก่ หน่วยงานราชการต่างๆ 54 ล้านครั้ง ตามด้วยอุตสาหกรรมการผลิต 36 ล้านครั้ง และอันดับ 3 สถาบันการเงิน 34 ล้านครั้ง อันดับ 4 หน่วยงานด้านสาธารณสุข 17 ล้านครั้ง เฉพาะ 4 กลุ่มแรก รวม 141 ล้านครั้ง ทั้งนี้ ประเทศที่โดนโจมตีมากที่สุด คือสหรัฐ ถูกโจมตีกว่า 12 ล้านครั้ง 
	
	&quot;ในสหรัฐ หน่วยงานอย่างเอฟบีไอ กระทรวงกลาโหม และซีไอเอ อาจตกเป็นเป้าโจมตี เพราะท้าทายกับอาชญากรที่เข้ามาทดสอบความแข็งแกร่งระบบ แต่ไทย หน่วยงานราชการที่จัดเก็บธุรกรรมการเงินต่างๆ อย่างกรมสรรพากร ก็อาจเป็นเป้าหมายที่ต้องเพิ่มความเข้มแข็งของระบบให้มากขึ้นด้วย&quot; นายชุติเดช กล่าว 
	
	หน่วยราชการไทยไม่ใช่เป้าหมาย 
	
	อย่างไรก็ตาม สำหรับประเทศไทย หน่วยงานราชการไม่ใช่กลุ่มเป้าหมายการโจมตีอันดับ 1 เพราะเป็นเวบไซต์ภาษาไทย และให้ข้อมูล (อินฟอร์เมชั่น) มากกว่าเป็นเวบข้อมูลธุรกิจการเงินที่สำคัญ 
	
	นอกจากนั้น ยังพบว่า แนวโน้มการโจมตีทางอิเล็กทรอนิกส์จะมุ่งเลือกกลุ่มเป้าหมายในองค์กร หรืออุตสาหกรรมที่มีข้อมูลสำคัญทางธุรกิจ เพื่อฉวยโอกาสข่มขู่ นำข้อมูลไปใช้ 
	
	หรือเพื่อบีบเอาเงินจากลูกค้า ซึ่งอาชญากรเหล่านี้ใช้กลลวงใหม่ๆ หลอกล่อผู้ใช้ไปติดกับ (ฟิชชิ่ง) โดยล่อไปเวบไซต์น่าเชื่อถือ และให้กรอกข้อมูลส่วนตัว ส่วนมากมุ่งฟอกเงิน และปลอมแปลงเอกสาร ตามสถิติครึ่งปีแรกมีการกระทำลักษณะนี้ 35 ล้านครั้ง 
	
	ทั้งนี้ การโจมตีอิเล็กทรอนิกส์จะเพิ่มขึ้น 10 เท่าภายใน 1 ปี รวมการทำลายธุรกิจ การปลอมแปลงเอกสาร การขโมยลิขสิทธิ์ทรัพย์สินทางปัญญา การขโมยเงินจากองค์กร 
	
	เนคเทคทำมาตรฐานปลอดภัย 
	
	ด้านนายทวีศักดิ์ กออนันตกูล ผู้อำนวยการศูนย์เทคโนโลยีอิเล็กทรอนิกส์และคอมพิวเตอร์แห่งชาติ (เนคเทค) กล่าวว่า เนคเทคกำลังจัดทำมาตรฐานความปลอดภัยขั้นต่ำที่อิงมาตรฐานโลก เพื่อเสนอให้ธนาคารแห่งประเทศไทย (ธปท.) นำมาใช้กับสถาบันการเงิน 
	
	นายชุติเดช กล่าวว่า บริษัทเตรียมนำซอฟต์แวร์ไอบีเอ็ม สมาร์ท เซอร์วิแลนซ์ ซิสเต็มส์ (smart survillance system) ซึ่งเป็นซอฟต์แวร์อัจฉริยะสามารถวิเคราะห์และแจ้งเตือนถึงความผิดปกติได้ 
	
	สำหรับระบบดังกล่าว สามารถนำไปใช้กับลานจอดรถขององค์กรต่างๆ โดยระบบจะทำหน้าที่วิเคราะห์ และสังเกตการณ์ความผิดปกติ หากมีรถไม่คุ้นเคยเข้ามาจอดยังสถานที่นั้น ก็จะแจ้งเตือนอัตโนมัติไปยังผู้ดูแลรักษาความปลอดภัยได้ 
	
	นอกจากนั้น ระบบนี้ยังสามารถนำไปใช้ในสถานที่ที่กังวลต่อภัยการก่อการร้ายได้ เช่น สถานทูต โรงแรม รวมถึงสถาบันการเงินธนาคารที่ต้องการป้องกันการโจรกรรม 
	
	&quot;ระบบนี้ จะดูภาพดิจิทัลที่บันทึกจากกล้องวงจรปิดที่ใช้อินเทอร์เน็ต โปรโตคอล ซึ่งจะทราบทันที หากมีมอเตอร์ไซค์มาจอดหลังธนาคาร และแจ้งเตือน หรือมีรถที่ไม่คุ้นเคยเข้ามาจอดในลานจอดรถที่ปกติมีรถที่ต้องมาจอดเป็นประจำ&quot; นายชุติเดช กล่าว ";	
$small_pic ="02_13329.jpg";
$large_pic  = "01_14480.jpg";
$news_order=4;
mysql_query("INSERT INTO news SET "."news_ID='$news_ID' ".",news_type='$news_type' ".",headline ='$headline' ".",story_text ='$story_text' 
".",small_pic ='$small_pic' ".",large_pic ='$large_pic'".",news_order ='$news_order',created='$published',published='$published'") ;
//ข่าวที่5
$news_ID =5;
$news_type ="ข่าวเทคโนโลยี";
$headline  = "เครื่องยนต์พลังทอร์นาโด";
$story_text = 	"	พายุ “ทอร์นาโด” ที่มีความรุนแรงและสร้างความเสียหายให้กับชีวิตและทรัพย์สิน อย่างที่เราเคยเห็นกันในข่าวโทรทัศน์ เท่าที่มีการบันทึกกันไว้ไม่เคยเกิดขึ้นในบ้านเรา จะมีที่เห็นกันได้บ้างก็คือลมหมุนที่เรียกกันภาษาชาวบ้านว่า “ลมงวงช้าง” ที่ถึงแม้จะมีลักษณะภายนอกที่คล้ายๆ กัน แต่ปัจจัยการเกิดก็มีรายละเอียดที่ต่างกันและแน่นอนว่าความรุนแรงก็แตกต่างกันด้วย

	พายุทอร์นาโดจะเกิดขึ้นก็ต่อเมื่อมีเมฆขนาดใหญ่ที่เรียกว่า “คิวมูโลนิมบัส” (Cumulonimbus) หรือเรียกง่าย ๆ ว่าเมฆฝนฟ้าคะนองที่เกิดขึ้นบ่อยในบ้านเรา เมฆลักษณะนี้เป็นเมฆที่ก่อตัวในแนวดิ่งและเป็นตัวการที่ทำให้เกิดลมกระโชก ฟ้าแลบ ฟ้าร้อง ฯลฯ 

	เมื่อกลุ่มเมฆฝนฟ้าคะนองเคลื่อนผ่านไปยังบริเวณที่มีมวลอากาศร้อนอยู่เบื้องล่าง มวลอากาศร้อนก็จะยกตัวสูงขึ้น อากาศเย็นที่อยู่สูงขึ้นไปก็จะเข้ามาแทนที่ ลมหมุนที่ตามปกติเกิดได้ในแนวนอนจากความแตกต่างของความเร็วลมเบื้องล่างกับเบื้องบนก็จะถูกยกตัวขึ้นให้เป็นแนวตั้งและอาจกลายเป็นพายุทอร์นาโดได้ในที่สุด
	
	เกริ่นมาอย่างคร่าวๆ ก็เพื่อที่จะให้คุณผู้อ่านพอมองภาพออก เพราะว่าเรื่องราวที่นำมาฝากในสัปดาห์นี้มีความเกี่ยวข้องกับพายุทอร์นาโดอยู่ไม่น้อย โดยที่เรื่องของเรื่องนั้นมาจากไอเดียของวิศวกรที่ทำงานในโรงงานปิโตรเลียมในประเทศแคนาดา นามว่า Louis Michaud

	คุณ Michaud เป็นผู้คิดค้นและบุกเบิกในการสร้างเครื่องยนต์พลังลมหมุน (Atmospheric Vortex Engine) ที่ได้แรงบันดาลใจมาจากพายุทอร์นาโด ทั้งนี้ด้วยความคิดที่ว่าลมหมุนที่เกิดขึ้นจากพายุทอร์นาโดนั้น มีความรุนแรงไม่ใช่น้อย ซึ่งถ้าเราสามารถจำลองการเกิดของพายุทอร์นาโดหรือสร้างทอร์นาโด “เทียม” ขึ้นมาได้ เราก็จะสามารถใช้ประโยชน์จากลมหมุนนั้นมาปั่นกังหันลมที่ไปหมุนเครื่องกำเนิดไฟฟ้าออกมาเป็นกระแสไฟฟ้าให้เราใช้งานได้

	เครื่องยนต์ต้นแบบถูกสร้างขึ้นที่มลรัฐยูทาห์ ประเทศสหรัฐอเมริกา ด้วยรูปทรงลักษณะหอคอยทรงกลมสูง 15 เมตร และมีเส้นผ่าศูนย์กลาง 30 เมตร เครื่องยนต์นี้จำลองการเกิดของพายุทอร์นาโดด้วยการใช้เชื้อเพลิงเผาอากาศที่อยู่บริเวณด้านล่างของหอคอย แล้วปล่อยอากาศร้อนที่เต็มไปด้วยความชื้นตามท่อเข้าไปในนั้น ในทิศทางหรือมุมที่เหมาะสมและเอื้อต่อการเกิดลมหมุนแบบพายุทอร์นาโดมากที่สุด

	อากาศที่ผ่านเข้าไปจะถูกเผาให้ร้อนและค่อย ๆ ลอยตัวขึ้น ซึ่งความเร็วในการยกตัวขึ้นของมวลอากาศร้อนนั้นขึ้นอยู่กับความแตกต่างของระดับอุณหภูมิด้วย ถ้ามีความแตกต่างของระดับอุณหภูมิมาก ความเร็วในการยกตัว (กำลังของลมหมุน) ก็จะมากขึ้นตามลำดับ ซึ่งผลการทดสอบจากเครื่องยนต์ต้นแบบพบว่าสามารถจำลองการเกิดของพายุทอร์นาโดที่มีขนาดเส้นผ่าศูนย์กลางประมาณ 1 เมตรได้

	สาเหตุที่คุณ Michaud คิดค้นเครื่องยนต์พลังทอร์นาโดนั้นก็เนื่องมากจากการที่เห็นว่าในโรงงานผลิตกระแสไฟฟ้าไม่ว่าจะเป็นโรงไฟฟ้าพลังงานถ่านหิน โรงไฟฟ้าพลังงานนิวเคลียร์ หรือแม้แต่จากก๊าซธรรมชาติ จะมีความร้อนส่วนเกินที่เกิดจากกระบวนการผลิตเกิดขึ้นและถูกปล่อยออกมาสู่ภายนอกอย่างเปล่าประโยชน์เสมอ

	ดังนั้นแทนที่จะสร้างหอหล่อเย็นที่มีราคาแพงที่มีแต่ค่าใช้จ่าย ก็น่าจะหันมาใช้ประโยชน์จากเครื่องยนต์พลังทอร์นาโดที่อาศัยความร้อนส่วนเกินที่เกิดขึ้นในกระบวนการผลิตกระแสไฟฟ้า มาหมุนกังหันเพื่อผลิตกระแสไฟฟ้าอีกทอดหนึ่ง ซึ่งผลที่ได้ทำให้โรงงานผลิตกระแสไฟฟ้าสามารถเพิ่มประสิทธิภาพ (Efficiency) ในการผลิตกระแสไฟฟ้าได้ถึง 20 เปอร์เซ็นต์

	ทั้งนี้ทั้งนั้นเครื่องยนต์พลังทอร์นาโดเครื่องแรกที่สามารถผลิตกระแสไฟฟ้าได้จริงๆ นั้น คาดว่าจะใหญ่โตกว่านี้มาก คือมีความสูงราวๆ 100 เมตร และมีเส้นผ่าศูนย์กลางประมาณ 400 เมตร ซึ่งพร้อมที่จะดำเนินการสร้างหากว่ามีบริษัทผลิตกระแสไฟฟ้าติดต่อ เข้ามา

	จะว่าไปแล้วผลงานชิ้นนี้ได้รับกล่องหรือคำชมไปมากพอสมควร เนื่องจากเป็นผลงานที่มาจากวิธีคิดที่ “ฉลาด” และสามารถนำของที่ถูกทิ้งไปโดยเปล่าประโยชน์มาสร้างให้เกิดประโยชน์ อีกทั้งตัวเทคโนโลยีก็ไม่ได้มีความสลับซับซ้อนอะไรเกินไปนัก จึงน่าจะเป็นอีกหนึ่งตัวเลือกของพลังงานทางเลือกที่น่าสนใจทีเดียว";
$small_pic ="02_13302.jpg";
$large_pic  = "01_14454.jpg";
$news_order=5;
mysql_query("INSERT INTO news SET "."news_ID='$news_ID' ".",news_type='$news_type' ".",headline ='$headline' ".",story_text ='$story_text' 
".",small_pic ='$small_pic' ".",large_pic ='$large_pic'".",news_order ='$news_order',created='$published',published='$published'") ;
//ข่าวที่6
$news_ID =6;
$news_type ="ข่าวเทคโนโลยี";
$headline  = "ฉลอง 10 ปี ฟีโบ้ โชว์ &quot;ส้มจุก&quot; สู่ &quot;หุ่นยนต์ใจดี&quot;";
$story_text = 	"	ฟีโบ้ ฉลองครบรอบ 10 ปี จัดงานใหญ่ &quot;มหกรรมหุ่นยนต์สัญชาติไทย&quot; โชว์ &quot;ส้มจุก&quot; สุดยอดหุ่นยนต์ฮิวแมนนอยด์ ตัวแรกและตัวเดียวของไทยที่มีขนาดเท่าคนจริง หนักถึง 50 กิโลกรัม สามารถเดินได้คล้ายมนุษย์ โดยติดเซ็นเซอร์วิเคราะห์แรงที่เท้าและวัดความเร็วความเร่งเชิงมุมต่างๆ ซึ่งศึกษามาจากการทรงตัวของมนุษย์
	
	ล่าสุด!!! &quot;ส้มจุก&quot; ถูกพัฒนาย่อส่วนจากขนาดเท่ามนุษย์เหลือความสูงเพียง 38 เซนติเมตร หรือประมาณหนึ่งไม้บรรทัดกว่า ๆ น้ำหนัก 3.3 กิโลกรัม โดยตั้งชื่อใหม่ว่า &quot;หุ่นยนต์ใจดี&quot; สามารถเดินได้เร็ว 2 เมตร/นาที มีระบบประมวลผลที่คิดวางแผนการก้าวเท้าและหลบหลีกสิ่งกีดขวางเพื่อเตะลูกบอล รวมทั้งสามารถลุกขึ้นยืนได้เองอัตโนมัติเมื่อหกล้ม ทั้งนี้ ใจดี เคยผ่านการแข่งขัน Robocup 2005 ในสาขา RobocupSoccer Humanoid league ที่ประเทศญี่ปุ่นมาแล้ว 
	
	นอกจากนี้ภายในงานยังมีสิ่งประดิษฐ์ที่น่าสนใจอื่นๆ อาทิ หุ่นยนต์สุนัข ซึ่งถูกออกแบบมาให้มีท่าทางคล้ายเจ้าตูบ สามารถเดินหน้า ถอยหลัง กลิ้งตัว หันซ้าย หันขวา นั่ง และหมอบ อนาคตคาดว่าจะพัฒนาต่อยอดให้สามารถตอบโต้กับคนได้, การควบคุมแขนหุ่นยนต์โดยใช้สัญญาณไฟฟ้าทางชีวภาพ, หุ่นยนต์ล้อ-แขน และ หุ่นยนต์สามขา 
	
	สนใจอัพเดทนวัตกรรมจากฝีมือคนไทยจากอดีตสู่ปัจจุบัน อย่าลืมไปงาน‘มหกรรมหุ่นยนต์สัญชาติไทย’ระหว่างวันที่ 11-12 พ.ย.นี้ เวลา 09.00-17.00 น. ณ อาคารสำนักงานอธิการบดี (ชั้น 1) มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี ";
$small_pic ="02_13272.jpg";
$large_pic  = "01_14424.jpg";
$news_order=6;
mysql_query("INSERT INTO news SET "."news_ID='$news_ID' ".",news_type='$news_type' ".",headline ='$headline' ".",story_text ='$story_text' 
".",small_pic ='$small_pic' ".",large_pic ='$large_pic'".",news_order ='$news_order',created='$published',published='$published'") ;
?>
